{
  "25230742-8e8c-4c00-90e9-a6c749a1d977": {
    "pk": "25230742-8e8c-4c00-90e9-a6c749a1d977",
    "title": "IllumiNeRF: 3D Relighting without Inverse Rendering",
    "abstract": "Existing methods for relightable view synthesis -- using a set of images of an object under unknown lighting to recover a 3D representation that can be rendered from novel viewpoints under a target illumination -- are based on inverse rendering, and attempt to disentangle the object geometry, materials, and lighting that explain the input images. Furthermore, this typically involves optimization through differentiable Monte Carlo rendering, which is brittle and computationally-expensive. In this work, we propose a simpler approach: we first relight each input image using an image diffusion model conditioned on lighting and then reconstruct a Neural Radiance Field (NeRF) with these relit images, from which we render novel views under the target lighting. We demonstrate that this strategy is surprisingly competitive and achieves state-of-the-art results on multiple relighting benchmarks. Please see our project page at https://illuminerf.github.io/.",
    "authors": [
      "Xiaoming Zhao",
      "Pratul P. Srinivasan",
      "Dor Verbin",
      "Keunhong Park",
      "Ricardo Martin Brualla",
      "Philipp Henzler"
    ],
    "url": "http://arxiv.org/abs/2406.06527v1",
    "timestamp": 1718042399,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c8a8c7b2-2556-494e-acb0-6333b54d0703": {
    "pk": "c8a8c7b2-2556-494e-acb0-6333b54d0703",
    "title": "Decentralized Personalized Federated Learning",
    "abstract": "This work tackles the challenges of data heterogeneity and communication limitations in decentralized federated learning. We focus on creating a collaboration graph that guides each client in selecting suitable collaborators for training personalized models that leverage their local data effectively. Our approach addresses these issues through a novel, communication-efficient strategy that enhances resource efficiency. Unlike traditional methods, our formulation identifies collaborators at a granular level by considering combinatorial relations of clients, enhancing personalization while minimizing communication overhead. We achieve this through a bi-level optimization framework that employs a constrained greedy algorithm, resulting in a resource-efficient collaboration graph for personalized learning. Extensive evaluation against various baselines across diverse datasets demonstrates the superiority of our method, named DPFL. DPFL consistently outperforms other approaches, showcasing its effectiveness in handling real-world data heterogeneity, minimizing communication overhead, enhancing resource efficiency, and building personalized models in decentralized federated learning scenarios.",
    "authors": [
      "Salma Kharrat",
      "Marco Canini",
      "Samuel Horvath"
    ],
    "url": "http://arxiv.org/abs/2406.06520v1",
    "timestamp": 1718042328,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "93a3061b-bf0e-40ce-9c72-91b7a27cde98": {
    "pk": "93a3061b-bf0e-40ce-9c72-91b7a27cde98",
    "title": "Genomics-guided Representation Learning for Pathologic Pan-cancer Tumor Microenvironment Subtype Prediction",
    "abstract": "The characterization of Tumor MicroEnvironment (TME) is challenging due to its complexity and heterogeneity. Relatively consistent TME characteristics embedded within highly specific tissue features, render them difficult to predict. The capability to accurately classify TME subtypes is of critical significance for clinical tumor diagnosis and precision medicine. Based on the observation that tumors with different origins share similar microenvironment patterns, we propose PathoTME, a genomics-guided Siamese representation learning framework employing Whole Slide Image (WSI) for pan-cancer TME subtypes prediction. Specifically, we utilize Siamese network to leverage genomic information as a regularization factor to assist WSI embeddings learning during the training phase. Additionally, we employ Domain Adversarial Neural Network (DANN) to mitigate the impact of tissue type variations. To eliminate domain bias, a dynamic WSI prompt is designed to further unleash the model's capabilities. Our model achieves better performance than other state-of-the-art methods across 23 cancer types on TCGA dataset. Our code is available at https://github.com/Mengflz/PathoTME.",
    "authors": [
      "Fangliangzi Meng",
      "Hongrun Zhang",
      "Ruodan Yan",
      "Guohui Chuai",
      "Chao Li",
      "Qi Liu"
    ],
    "url": "http://arxiv.org/abs/2406.06517v1",
    "timestamp": 1718042181,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5f71ec51-fc33-4c26-817a-8e93fc9da82b": {
    "pk": "5f71ec51-fc33-4c26-817a-8e93fc9da82b",
    "title": "Spin-photon entanglement of a single Er$^{3+}$ ion in the telecom band",
    "abstract": "Long-distance quantum communication using quantum repeaters is an enabling technology for secure communication, distributed quantum computing and quantum-enhanced sensing and metrology. As a building block of quantum repeaters, spin-photon entanglement has been demonstrated with both atomic and solid-state qubits. However, previously demonstrated qubits with long spin coherence do not directly emit photons into the low-loss telecom band that is needed for long-distance communication. Here, we demonstrate spin-photon entanglement using a single Er$^{3+}$ ion in a solid-state crystal, integrated into a silicon nanophotonic circuit. Direct emission into the telecom band enables an entanglement rate of 1.48 Hz over 15.6 km of optical fiber, with a fidelity of 73(3)$\\%$. This opens the door to large-scale quantum networks based on scalable nanophotonic devices and many spectrally multiplexed Er$^{3+}$ ions.",
    "authors": [
      "Mehmet T. Uysal",
      "Łukasz Dusanowski",
      "Haitong Xu",
      "Sebastian P. Horvath",
      "Salim Ourari",
      "Robert J. Cava",
      "Nathalie P. de Leon",
      "Jeff D. Thompson"
    ],
    "url": "http://arxiv.org/abs/2406.06515v1",
    "timestamp": 1718042125,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c2f18f0d-b108-418f-988a-077389825577": {
    "pk": "c2f18f0d-b108-418f-988a-077389825577",
    "title": "Merlin: A Vision Language Foundation Model for 3D Computed Tomography",
    "abstract": "Over 85 million computed tomography (CT) scans are performed annually in the US, of which approximately one quarter focus on the abdomen. Given the current radiologist shortage, there is a large impetus to use artificial intelligence to alleviate the burden of interpreting these complex imaging studies. Prior state-of-the-art approaches for automated medical image interpretation leverage vision language models (VLMs). However, current medical VLMs are generally limited to 2D images and short reports, and do not leverage electronic health record (EHR) data for supervision. We introduce Merlin - a 3D VLM that we train using paired CT scans (6+ million images from 15,331 CTs), EHR diagnosis codes (1.8+ million codes), and radiology reports (6+ million tokens). We evaluate Merlin on 6 task types and 752 individual tasks. The non-adapted (off-the-shelf) tasks include zero-shot findings classification (31 findings), phenotype classification (692 phenotypes), and zero-shot cross-modal retrieval (image to findings and image to impressions), while model adapted tasks include 5-year disease prediction (6 diseases), radiology report generation, and 3D semantic segmentation (20 organs). We perform internal validation on a test set of 5,137 CTs, and external validation on 7,000 clinical CTs and on two public CT datasets (VerSe, TotalSegmentator). Beyond these clinically-relevant evaluations, we assess the efficacy of various network architectures and training strategies to depict that Merlin has favorable performance to existing task-specific baselines. We derive data scaling laws to empirically assess training data needs for requisite downstream task performance. Furthermore, unlike conventional VLMs that require hundreds of GPUs for training, we perform all training on a single GPU.",
    "authors": [
      "Louis Blankemeier",
      "Joseph Paul Cohen",
      "Ashwin Kumar",
      "Dave Van Veen",
      "Syed Jamal Safdar Gardezi",
      "Magdalini Paschali",
      "Zhihong Chen",
      "Jean-Benoit Delbrouck",
      "Eduardo Reis",
      "Cesar Truyts",
      "Christian Bluethgen",
      "Malte Engmann Kjeldskov Jensen",
      "Sophie Ostmeier",
      "Maya Varma",
      "Jeya Maria Jose Valanarasu",
      "Zhongnan Fang",
      "Zepeng Huo",
      "Zaid Nabulsi",
      "Diego Ardila",
      "Wei-Hung Weng",
      "Edson Amaro Junior",
      "Neera Ahuja",
      "Jason Fries",
      "Nigam H. Shah",
      "Andrew Johnston",
      "Robert D. Boutin",
      "Andrew Wentland",
      "Curtis P. Langlotz",
      "Jason Hom",
      "Sergios Gatidis",
      "Akshay S. Chaudhari"
    ],
    "url": "http://arxiv.org/abs/2406.06512v1",
    "timestamp": 1718041981,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b9fca715-0bd5-4758-803c-d319253e159c": {
    "pk": "b9fca715-0bd5-4758-803c-d319253e159c",
    "title": "Phragmèn-Lindelöf type theorems for elliptic equations on infinite graphs",
    "abstract": "We investigate the validity of the Phragm\\`en-Lindel\\\"of principle for a class of elliptic equations with a potential, posed on infinite graphs. Consequently, we get uniqueness, in the class of solutions satisfying a suitable growth condition at infinity. We suppose that the {\\it outer degree (or outer curvature)} of the graph is bounded from above, and we allow the potential to go to zero at infinity in a controlled way. Finally, we discuss the optimality of the condition on the potential on symmetric trees and on the integer lattice.",
    "authors": [
      "Stefano Biagi",
      "Fabio Punzo"
    ],
    "url": "http://arxiv.org/abs/2406.06505v1",
    "timestamp": 1718041419,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.AP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8fdf3717-1373-404e-9fdd-fd6d8c458dc5": {
    "pk": "8fdf3717-1373-404e-9fdd-fd6d8c458dc5",
    "title": "Equivariant Neural Tangent Kernels",
    "abstract": "Equivariant neural networks have in recent years become an important technique for guiding architecture selection for neural networks with many applications in domains ranging from medical image analysis to quantum chemistry. In particular, as the most general linear equivariant layers with respect to the regular representation, group convolutions have been highly impactful in numerous applications. Although equivariant architectures have been studied extensively, much less is known about the training dynamics of equivariant neural networks. Concurrently, neural tangent kernels (NTKs) have emerged as a powerful tool to analytically understand the training dynamics of wide neural networks. In this work, we combine these two fields for the first time by giving explicit expressions for NTKs of group convolutional neural networks. In numerical experiments, we demonstrate superior performance for equivariant NTKs over non-equivariant NTKs on a classification task for medical images.",
    "authors": [
      "Philipp Misof",
      "Pan Kessel",
      "Jan E. Gerken"
    ],
    "url": "http://arxiv.org/abs/2406.06504v1",
    "timestamp": 1718041393,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7a1774b6-f8f6-4e06-9c63-8e4b0b6ae152": {
    "pk": "7a1774b6-f8f6-4e06-9c63-8e4b0b6ae152",
    "title": "New bounds on a generalization of Tuza's conjecture",
    "abstract": "For a $k$-uniform hypergraph $H$, let $\\nu^{(m)}(H)$ denote the maximum size of a set $S$ of edges of $H$ whose pairwise intersection has size less than $m$. Let $\\tau^{(m)}(H)$ denote the minimum size of a set $S$ of $m$-sets of $V(H)$ such that every edge of $H$ contains some $m$-set from $S$. A conjecture by Aharoni and Zerbib, which generalizes a conjecture of Tuza on the size of minimum edge covers of triangles of a graph, states that for a $k$-uniform hypergraph $H$, $\\tau^{(k - 1)}(H)/\\nu^{(k - 1)}(H) \\leq \\left \\lceil \\frac{k + 1}{2} \\right \\rceil$. In this paper, we show that this generalization of Tuza's conjecture holds when $\\nu^{(k - 1)}(H) \\leq 3$. As a corollary, we obtain a graph class which satisfies Tuza's conjecture. We also prove various bounds on $\\tau^{(m)}(H)/\\nu^{(m)}(H)$ for other values of $m$ as well as some bounds on the fractional analogues of these numbers.",
    "authors": [
      "Alex Parker"
    ],
    "url": "http://arxiv.org/abs/2406.06501v1",
    "timestamp": 1718040898,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8de842bd-aa9a-452d-9b07-a106930e2808": {
    "pk": "8de842bd-aa9a-452d-9b07-a106930e2808",
    "title": "NarrativeBridge: Enhancing Video Captioning with Causal-Temporal Narrative",
    "abstract": "Existing video captioning benchmarks and models lack coherent representations of causal-temporal narrative, which is sequences of events linked through cause and effect, unfolding over time and driven by characters or agents. This lack of narrative restricts models' ability to generate text descriptions that capture the causal and temporal dynamics inherent in video content. To address this gap, we propose NarrativeBridge, an approach comprising of: (1) a novel Causal-Temporal Narrative (CTN) captions benchmark generated using a large language model and few-shot prompting, explicitly encoding cause-effect temporal relationships in video descriptions, evaluated automatically to ensure caption quality and relevance; and (2) a dedicated Cause-Effect Network (CEN) architecture with separate encoders for capturing cause and effect dynamics independently, enabling effective learning and generation of captions with causal-temporal narrative. Extensive experiments demonstrate that CEN is more accurate in articulating the causal and temporal aspects of video content than the second best model (GIT): 17.88 and 17.44 CIDEr on the MSVD and MSR-VTT datasets, respectively. The proposed framework understands and generates nuanced text descriptions with intricate causal-temporal narrative structures present in videos, addressing a critical limitation in video captioning. For project details, visit https://narrativebridge.github.io/.",
    "authors": [
      "Asmar Nadeem",
      "Faegheh Sardari",
      "Robert Dawes",
      "Syed Sameed Husain",
      "Adrian Hilton",
      "Armin Mustafa"
    ],
    "url": "http://arxiv.org/abs/2406.06499v1",
    "timestamp": 1718040864,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "409c2b38-de75-44e6-9ed5-9cd813f6f2cf": {
    "pk": "409c2b38-de75-44e6-9ed5-9cd813f6f2cf",
    "title": "Rephasing spectral diffusion in time-bin spin-spin entanglement protocols",
    "abstract": "Generating high fidelity spin-spin entanglement is an essential task of quantum repeater networks for the distribution of quantum information across long distances. Solid-state based spin-photon interfaces are promising candidates to realize nodes of a quantum network, but are often limited by spectral diffusion of the optical transition, which results in phase errors on the entangled states. Here, we introduce a method to correct phase errors from quasi-static frequency fluctuations after the entangled state is generated, by shelving the emitters in the excited state to refocus the unknown phase. For quasi-static frequency fluctuations, the fidelity is determined only by the lifetime of the excited state used for shelving, making it particularly suitable for systems with a long-lived shelving state with correlated spectral diffusion. Such a shelving state may be found in Kramers doublet systems such as rare-earth emitters and color centers in Si or SiC interfaced with nanophotonic cavities with a strongly frequency-dependent Purcell enhancement. The protocol can be used to generate high-fidelity entangled spin pairs without reducing the rate of entanglement generation.",
    "authors": [
      "Mehmet T. Uysal",
      "Jeff D. Thompson"
    ],
    "url": "http://arxiv.org/abs/2406.06497v1",
    "timestamp": 1718040807,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "95c84ec0-ef93-467d-83cd-06807a8429e5": {
    "pk": "95c84ec0-ef93-467d-83cd-06807a8429e5",
    "title": "Boosting Robustness in Preference-Based Reinforcement Learning with Dynamic Sparsity",
    "abstract": "For autonomous agents to successfully integrate into human-centered environments, agents should be able to learn from and adapt to humans in their native settings. Preference-based reinforcement learning (PbRL) is a promising approach that learns reward functions from human preferences. This enables RL agents to adapt their behavior based on human desires. However, humans live in a world full of diverse information, most of which is not relevant to completing a particular task. It becomes essential that agents learn to focus on the subset of task-relevant environment features. Unfortunately, prior work has largely ignored this aspect; primarily focusing on improving PbRL algorithms in standard RL environments that are carefully constructed to contain only task-relevant features. This can result in algorithms that may not effectively transfer to a more noisy real-world setting. To that end, this work proposes R2N (Robust-to-Noise), the first PbRL algorithm that leverages principles of dynamic sparse training to learn robust reward models that can focus on task-relevant features. We study the effectiveness of R2N in the Extremely Noisy Environment setting, an RL problem setting where up to 95% of the state features are irrelevant distractions. In experiments with a simulated teacher, we demonstrate that R2N can adapt the sparse connectivity of its neural networks to focus on task-relevant features, enabling R2N to significantly outperform several state-of-the-art PbRL algorithms in multiple locomotion and control environments.",
    "authors": [
      "Calarina Muslimani",
      "Bram Grooten",
      "Deepak Ranganatha Sastry Mamillapalli",
      "Mykola Pechenizkiy",
      "Decebal Constantin Mocanu",
      "Matthew E. Taylor"
    ],
    "url": "http://arxiv.org/abs/2406.06495v1",
    "timestamp": 1718040667,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "cc51ed68-e402-470b-bbc7-87bcfe96d4d3": {
    "pk": "cc51ed68-e402-470b-bbc7-87bcfe96d4d3",
    "title": "Scaling Continuous Latent Variable Models as Probabilistic Integral Circuits",
    "abstract": "Probabilistic integral circuits (PICs) have been recently introduced as probabilistic models enjoying the key ingredient behind expressive generative models: continuous latent variables (LVs). PICs are symbolic computational graphs defining continuous LV models as hierarchies of functions that are summed and multiplied together, or integrated over some LVs. They are tractable if LVs can be analytically integrated out, otherwise they can be approximated by tractable probabilistic circuits (PC) encoding a hierarchical numerical quadrature process, called QPCs.   So far, only tree-shaped PICs have been explored, and training them via numerical quadrature requires memory-intensive processing at scale. In this paper, we address these issues, and present: (i) a pipeline for building DAG-shaped PICs out of arbitrary variable decompositions, (ii) a procedure for training PICs using tensorized circuit architectures, and (iii) neural functional sharing techniques to allow scalable training. In extensive experiments, we showcase the effectiveness of functional sharing and the superiority of QPCs over traditional PCs.",
    "authors": [
      "Gennaro Gala",
      "Cassio de Campos",
      "Antonio Vergari",
      "Erik Quaeghebeur"
    ],
    "url": "http://arxiv.org/abs/2406.06494v1",
    "timestamp": 1718040617,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "96964b76-fcba-46db-9f5a-cffbd81c1615": {
    "pk": "96964b76-fcba-46db-9f5a-cffbd81c1615",
    "title": "Input Driven Synchronization of Chaotic Neural Networks with Analyticaly Determined Conditional Lyapunov Exponents",
    "abstract": "Recurrent neural networks (RNNs) with random, but sufficiently strong and balanced coupling display a well known high-dimensional chaotic dynamics. Here, we investigate if externally applied inputs to these RNNs can stabilize globally synchronous, input-dependent solutions, in spite of the strong chaos-inducing coupling. We find that when the balance between excitation and inhibition is exact, that is when the row-sum of the weights is constant and 0, a globally applied input can readily synchronize all neurons onto a synchronous solution. The stability of the synchronous solution is analytically explored in this work with a master stability function. For any synchronous solution to the network dynamics, the conditional Lyapunov spectrum can be readily determined, with the stability of the synchronous solution critically dependent on the largest real eigenvalue component of the RNN weight matrix. We find that the smaller the maximum real component of the weight matrix eigenvalues, the more readily the network synchronizes. Further, the conditional Lyapunov exponents are easily computed numerically for any synchronization signal without simulating the RNN. Finally, for certain oscillatory synchronization signals, the conditional Lyapunov exponents can be determined analytically.",
    "authors": [
      "Jordan Culp",
      "Wilten Nicola"
    ],
    "url": "http://arxiv.org/abs/2406.06491v1",
    "timestamp": 1718040543,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "nlin.CD",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "5404df9c-3d44-4e70-a6c9-1f39a9f5db39": {
    "pk": "5404df9c-3d44-4e70-a6c9-1f39a9f5db39",
    "title": "How much longer do you have to drive than the crow has to fly?",
    "abstract": "When we travel by car from one location to another, our route is constrained by the road network. The resulting network distance is generally longer than the geodetic distance, i.e. the distance as the crow flies, between the two locations. We report a systematic relation between the statistical properties of these two distances. In empirical analyses for large motorway networks in various countries and areas, we work out distributions of network and geodetic distances and identify a surprisingly robust scaling property between them. A simple consequence is that we typically have to drive $1.3\\pm0.1$ times longer than the crow flies. Moreover, we show that this scaling is not present in standard random networks; rather, it requires a certain non-randomness, namely adjacency. We develop a set of rules to build a realistic motorway network, also consistent with the scaling properties found empirically. We hypothesize that the scaling reflects, in a rather universal fashion, a compromise between two societal needs: high efficiency and accessibility on the one hand, and limitation of costs and other burdens on the other.",
    "authors": [
      "Shanshan Wang",
      "Henrik M. Bette",
      "Michael Schreckenberg",
      "Thomas Guhr"
    ],
    "url": "http://arxiv.org/abs/2406.06490v1",
    "timestamp": 1718040463,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.soc-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c4f30fea-f042-4b48-a05b-ca501bce08f5": {
    "pk": "c4f30fea-f042-4b48-a05b-ca501bce08f5",
    "title": "Probing out-of-distribution generalization in machine learning for materials",
    "abstract": "Scientific machine learning (ML) endeavors to develop generalizable models with broad applicability. However, the assessment of generalizability is often based on heuristics. Here, we demonstrate in the materials science setting that heuristics based evaluations lead to substantially biased conclusions of ML generalizability and benefits of neural scaling. We evaluate generalization performance in over 700 out-of-distribution tasks that features new chemistry or structural symmetry not present in the training data. Surprisingly, good performance is found in most tasks and across various ML models including simple boosted trees. Analysis of the materials representation space reveals that most tasks contain test data that lie in regions well covered by training data, while poorly-performing tasks contain mainly test data outside the training domain. For the latter case, increasing training set size or training time has marginal or even adverse effects on the generalization performance, contrary to what the neural scaling paradigm assumes. Our findings show that most heuristically-defined out-of-distribution tests are not genuinely difficult and evaluate only the ability to interpolate. Evaluating on such tasks rather than the truly challenging ones can lead to an overestimation of generalizability and benefits of scaling.",
    "authors": [
      "Kangming Li",
      "Andre Niyongabo Rubungo",
      "Xiangyun Lei",
      "Daniel Persaud",
      "Kamal Choudhary",
      "Brian DeCost",
      "Adji Bousso Dieng",
      "Jason Hattrick-Simpers"
    ],
    "url": "http://arxiv.org/abs/2406.06489v1",
    "timestamp": 1718040432,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.mtrl-sci",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "eb435b1e-0dbe-4cf4-b245-28b26ca97a36": {
    "pk": "eb435b1e-0dbe-4cf4-b245-28b26ca97a36",
    "title": "Continuum Attention for Neural Operators",
    "abstract": "Transformers, and the attention mechanism in particular, have become ubiquitous in machine learning. Their success in modeling nonlocal, long-range correlations has led to their widespread adoption in natural language processing, computer vision, and time-series problems. Neural operators, which map spaces of functions into spaces of functions, are necessarily both nonlinear and nonlocal if they are universal; it is thus natural to ask whether the attention mechanism can be used in the design of neural operators. Motivated by this, we study transformers in the function space setting. We formulate attention as a map between infinite dimensional function spaces and prove that the attention mechanism as implemented in practice is a Monte Carlo or finite difference approximation of this operator. The function space formulation allows for the design of transformer neural operators, a class of architectures designed to learn mappings between function spaces, for which we prove a universal approximation result. The prohibitive cost of applying the attention operator to functions defined on multi-dimensional domains leads to the need for more efficient attention-based architectures. For this reason we also introduce a function space generalization of the patching strategy from computer vision, and introduce a class of associated neural operators. Numerical results, on an array of operator learning problems, demonstrate the promise of our approaches to function space formulations of attention and their use in neural operators.",
    "authors": [
      "Edoardo Calvello",
      "Nikola B. Kovachki",
      "Matthew E. Levine",
      "Andrew M. Stuart"
    ],
    "url": "http://arxiv.org/abs/2406.06486v1",
    "timestamp": 1718040346,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "93765928-597e-4fe2-8c79-697bb7bd37cc": {
    "pk": "93765928-597e-4fe2-8c79-697bb7bd37cc",
    "title": "A Taxonomy and Comparative Analysis of IPv4 ID Selection Correctness, Security, and Performance",
    "abstract": "The battle for a more secure Internet is waged on many fronts, including the most basic of networking protocols. Our focus is the IPv4 Identifier (IPID), an IPv4 header field as old as the Internet with an equally long history as an exploited side channel for scanning network properties, inferring off-path connections, and poisoning DNS caches. This article taxonomizes the 25-year history of IPID-based exploits and the corresponding changes to IPID selection methods. By mathematically analyzing these methods' correctness and security and empirically evaluating their performance, we reveal recommendations for best practice as well as shortcomings of current operating system implementations, emphasizing the value of systematic evaluations in network security.",
    "authors": [
      "Joshua J. Daymude",
      "Antonio M. Espinoza",
      "Sean Bergen",
      "Benjamin Mixon-Baca",
      "Jeffrey Knockel",
      "Jedidiah R. Crandall"
    ],
    "url": "http://arxiv.org/abs/2406.06483v1",
    "timestamp": 1718040137,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "3bf7cdda-fc9f-4db0-8389-661102f72e2c": {
    "pk": "3bf7cdda-fc9f-4db0-8389-661102f72e2c",
    "title": "Quantum Equilibrium Propagation for efficient training of quantum systems based on Onsager reciprocity",
    "abstract": "The widespread adoption of machine learning and artificial intelligence in all branches of science and technology has created a need for energy-efficient, alternative hardware platforms. While such neuromorphic approaches have been proposed and realised for a wide range of platforms, physically extracting the gradients required for training remains challenging as generic approaches only exist in certain cases. Equilibrium propagation (EP) is such a procedure that has been introduced and applied to classical energy-based models which relax to an equilibrium. Here, we show a direct connection between EP and Onsager reciprocity and exploit this to derive a quantum version of EP. This can be used to optimize loss functions that depend on the expectation values of observables of an arbitrary quantum system. Specifically, we illustrate this new concept with supervised and unsupervised learning examples in which the input or the solvable task is of quantum mechanical nature, e.g., the recognition of quantum many-body ground states, quantum phase exploration, sensing and phase boundary exploration. We propose that in the future quantum EP may be used to solve tasks such as quantum phase discovery with a quantum simulator even for Hamiltonians which are numerically hard to simulate or even partially unknown. Our scheme is relevant for a variety of quantum simulation platforms such as ion chains, superconducting qubit arrays, neutral atom Rydberg tweezer arrays and strongly interacting atoms in optical lattices.",
    "authors": [
      "Clara C. Wanjura",
      "Florian Marquardt"
    ],
    "url": "http://arxiv.org/abs/2406.06482v1",
    "timestamp": 1718040129,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "3ae4325f-8a5c-45b1-8d53-63acfc20c6ab": {
    "pk": "3ae4325f-8a5c-45b1-8d53-63acfc20c6ab",
    "title": "Centers of Artin groups defined on cones",
    "abstract": "We prove that the Center Conjecture passes to the Artin groups whose defining graphs are cones, if the conjecture holds for the Artin group defined on the set of the cone points. In particular, it holds for every Artin group whose defining graph has exactly one cone point.",
    "authors": [
      "Kasia Jankiewicz",
      "MurphyKate Montee"
    ],
    "url": "http://arxiv.org/abs/2406.06480v1",
    "timestamp": 1718040022,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.GR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9c236295-0eb0-442f-89de-c19783de7638": {
    "pk": "9c236295-0eb0-442f-89de-c19783de7638",
    "title": "Graph-Based Bidirectional Transformer Decision Threshold Adjustment Algorithm for Class-Imbalanced Molecular Data",
    "abstract": "Data sets with imbalanced class sizes, often where one class size is much smaller than that of others, occur extremely often in various applications, including those with biological foundations, such as drug discovery and disease diagnosis. Thus, it is extremely important to be able to identify data elements of classes of various sizes, as a failure to detect can result in heavy costs. However, many data classification algorithms do not perform well on imbalanced data sets as they often fail to detect elements belonging to underrepresented classes. In this paper, we propose the BTDT-MBO algorithm, incorporating Merriman-Bence-Osher (MBO) techniques and a bidirectional transformer, as well as distance correlation and decision threshold adjustments, for data classification problems on highly imbalanced molecular data sets, where the sizes of the classes vary greatly. The proposed method not only integrates adjustments in the classification threshold for the MBO algorithm in order to help deal with the class imbalance, but also uses a bidirectional transformer model based on an attention mechanism for self-supervised learning. Additionally, the method implements distance correlation as a weight function for the similarity graph-based framework on which the adjusted MBO algorithm operates. The proposed model is validated using six molecular data sets, and we also provide a thorough comparison to other competing algorithms. The computational experiments show that the proposed method performs better than competing techniques even when the class imbalance ratio is very high.",
    "authors": [
      "Nicole Hayes",
      "Ekaterina Merkurjev",
      "Guo-Wei Wei"
    ],
    "url": "http://arxiv.org/abs/2406.06479v1",
    "timestamp": 1718040013,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1e122e6b-c1b1-4dc8-ba5b-98bc7b774697": {
    "pk": "1e122e6b-c1b1-4dc8-ba5b-98bc7b774697",
    "title": "DiffAudit: Auditing Privacy Practices of Online Services for Children and Adolescents",
    "abstract": "Children's and adolescents' online data privacy are regulated by laws such as the Children's Online Privacy Protection Act (COPPA) and the California Consumer Privacy Act (CCPA). Online services that are directed towards general audiences (i.e., including children, adolescents, and adults) must comply with these laws. In this paper, first, we present DiffAudit, a platform-agnostic privacy auditing methodology for general audience services. DiffAudit performs differential analysis of network traffic data flows to compare data processing practices (i) between child, adolescent, and adult users and (ii) before and after consent is given and user age is disclosed. We also present a data type classification method that utilizes GPT-4 and our data type ontology based on COPPA and CCPA, allowing us to identify considerably more data types than prior work. Second, we apply DiffAudit to a set of popular general audience mobile and web services and observe a rich set of behaviors extracted from over 440K outgoing requests, containing 3,968 unique data types we extracted and classified. We reveal problematic data processing practices prior to consent and age disclosure, lack of differentiation between age-specific data flows, inconsistent privacy policy disclosures, and sharing of linkable data with third parties, including advertising and tracking services.",
    "authors": [
      "Olivia Figueira",
      "Rahmadi Trimananda",
      "Athina Markopoulou",
      "Scott Jordan"
    ],
    "url": "http://arxiv.org/abs/2406.06473v1",
    "timestamp": 1718039693,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fd617e44-d355-4e45-9ff0-8db83fa94695": {
    "pk": "fd617e44-d355-4e45-9ff0-8db83fa94695",
    "title": "GKAN: Graph Kolmogorov-Arnold Networks",
    "abstract": "We introduce Graph Kolmogorov-Arnold Networks (GKAN), an innovative neural network architecture that extends the principles of the recently proposed Kolmogorov-Arnold Networks (KAN) to graph-structured data. By adopting the unique characteristics of KANs, notably the use of learnable univariate functions instead of fixed linear weights, we develop a powerful model for graph-based learning tasks. Unlike traditional Graph Convolutional Networks (GCNs) that rely on a fixed convolutional architecture, GKANs implement learnable spline-based functions between layers, transforming the way information is processed across the graph structure. We present two different ways to incorporate KAN layers into GKAN: architecture 1 -- where the learnable functions are applied to input features after aggregation and architecture 2 -- where the learnable functions are applied to input features before aggregation. We evaluate GKAN empirically using a semi-supervised graph learning task on a real-world dataset (Cora). We find that architecture generally performs better. We find that GKANs achieve higher accuracy in semi-supervised learning tasks on graphs compared to the traditional GCN model. For example, when considering 100 features, GCN provides an accuracy of 53.5 while a GKAN with a comparable number of parameters gives an accuracy of 61.76; with 200 features, GCN provides an accuracy of 61.24 while a GKAN with a comparable number of parameters gives an accuracy of 67.66. We also present results on the impact of various parameters such as the number of hidden nodes, grid-size, and the polynomial-degree of the spline on the performance of GKAN.",
    "authors": [
      "Mehrdad Kiamari",
      "Mohammad Kiamari",
      "Bhaskar Krishnamachari"
    ],
    "url": "http://arxiv.org/abs/2406.06470v1",
    "timestamp": 1718039378,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ffb9bf6b-fa23-43ab-b3a0-dcccc2ba5bb5": {
    "pk": "ffb9bf6b-fa23-43ab-b3a0-dcccc2ba5bb5",
    "title": "Which topics are best represented by science maps? An analysis of clustering effectiveness for citation and text similarity networks",
    "abstract": "A science map of topics is a visualization that shows topics identified algorithmically based on the bibliographic metadata of scientific publications. In practice not all topics are well represented in a science map. We analyzed how effectively different topics are represented in science maps created by clustering biomedical publications. To achieve this, we investigated which topic categories, obtained from MeSH terms, are better represented in science maps based on citation or text similarity networks. To evaluate the clustering effectiveness of topics, we determined the extent to which documents belonging to the same topic are grouped together in the same cluster. We found that the best and worst represented topic categories are the same for citation and text similarity networks. The best represented topic categories are diseases, psychology, anatomy, organisms and the techniques and equipment used for diagnostics and therapy, while the worst represented topic categories are natural science fields, geographical entities, information sciences and health care and occupations. Furthermore, for the diseases and organisms topic categories and for science maps with smaller clusters, we found that topics tend to be better represented in citation similarity networks than in text similarity networks.",
    "authors": [
      "Juan Pablo Bascur",
      "Suzan Verberne",
      "Nees Jan van Eck",
      "Ludo Waltman"
    ],
    "url": "http://arxiv.org/abs/2406.06454v1",
    "timestamp": 1718037827,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.DL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "6004fdd4-5d40-46ac-bb66-2b6e364944d3": {
    "pk": "6004fdd4-5d40-46ac-bb66-2b6e364944d3",
    "title": "Time Series Analysis: yesterday, today, tomorrow",
    "abstract": "Forecasts of various processes have always been a sophisticated problem for statistics and data science. Over the past decades the solution procedures were updated by deep learning and kernel methods. According to many specialists, these approaches are much more precise, stable, and suitable compared to the classical statistical linear time series methods. Here we investigate how true this point of view is.",
    "authors": [
      "Igor Mackarov"
    ],
    "url": "http://arxiv.org/abs/2406.06453v1",
    "timestamp": 1718037764,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ccff3c9c-af41-4bb9-9b59-04e345b5092f": {
    "pk": "ccff3c9c-af41-4bb9-9b59-04e345b5092f",
    "title": "Cometh: A continuous-time discrete-state graph diffusion model",
    "abstract": "Discrete-state denoising diffusion models led to state-of-the-art performance in graph generation, especially in the molecular domain. Recently, they have been transposed to continuous time, allowing more flexibility in the reverse process and a better trade-off between sampling efficiency and quality. Here, to leverage the benefits of both approaches, we propose Cometh, a continuous-time discrete-state graph diffusion model, integrating graph data into a continuous-time diffusion model framework. Empirically, we show that integrating continuous time leads to significant improvements across various metrics over state-of-the-art discrete-state diffusion models on a large set of molecular and non-molecular benchmark datasets.",
    "authors": [
      "Antoine Siraudin",
      "Fragkiskos D. Malliaros",
      "Christopher Morris"
    ],
    "url": "http://arxiv.org/abs/2406.06449v1",
    "timestamp": 1718037579,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f92f22f3-5bed-46a3-9ee8-a83e32d45c28": {
    "pk": "f92f22f3-5bed-46a3-9ee8-a83e32d45c28",
    "title": "Messengers: Breaking Echo Chambers in Collective Opinion Dynamics with Homophily",
    "abstract": "Collective estimation manifests computational intelligence emerging from inter-individual local interactions, e.g., by aggregating opinions from neighbors to estimate a quantity. Use cases of collective estimation may include directed motion in physical space, such that agents, for example, have to collectively explore a distributed feature, and collectively agree on a numerical value. In doing so, collectives face several challenges in achieving precise estimations. These challenges exhibit complex behaviors, particularly when the interaction network and opinion of agents evolve simultaneously. We take homophilic networks as an example, where disproportionate interaction with like-minded neighbors leads to the emergence of echo chambers, preventing collective consensus. Our simulation results confirm that, besides a lack of exposure to attitude-challenging opinions, seeking reaffirming information entraps agents in echo chambers. We propose a generic novel approach based on a Dichotomous Markov Process (DMP) where stubborn agents (called Messengers) connect the disconnected clusters by physically transporting their opinions to other clusters to inform and direct the other agents. We show that diverse collective behaviors arise from the DMP and study a continuum between task specialization with no switching (full-time Messengers), generalization with slow task switching (part-time Messengers), and rapid task switching (short-time Messengers) and its impact on system performance. Our results show that stubborn agents can, in various ways, break the echo chambers and promote consensus in collective opinion.",
    "authors": [
      "Mohsen Raoufi",
      "Heiko Hamann",
      "Pawel Romanczuk"
    ],
    "url": "http://arxiv.org/abs/2406.06440v1",
    "timestamp": 1718037203,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.SI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7c8484bc-1ee9-40d8-a2ca-5bc1aa8bdca8": {
    "pk": "7c8484bc-1ee9-40d8-a2ca-5bc1aa8bdca8",
    "title": "Topological Applications of p-Adic Divergence and Gradient Operators",
    "abstract": "$p$-Adic divergence and gradient operators are constructed giving rise to $p$-adic vertex Laplacian operators used by Z\\'u\\~niga in order to study Turing patterns on graphs, as well as their edge Laplacian counterparts. It is shown that the Euler characteristic of a finite graph can be expressed via traces of certain heat kernels associated with these new operators. This result is applied to the extraction of topological information from Mumford curves via heat kernels.",
    "authors": [
      "Patrick Erik Bradley"
    ],
    "url": "http://arxiv.org/abs/2406.06439v1",
    "timestamp": 1718037135,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.AP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f192bfd3-10be-4ef1-a6f4-00e2e1fdea1a": {
    "pk": "f192bfd3-10be-4ef1-a6f4-00e2e1fdea1a",
    "title": "Multimodal Contextualized Semantic Parsing from Speech",
    "abstract": "We introduce Semantic Parsing in Contextual Environments (SPICE), a task designed to enhance artificial agents' contextual awareness by integrating multimodal inputs with prior contexts. SPICE goes beyond traditional semantic parsing by offering a structured, interpretable framework for dynamically updating an agent's knowledge with new information, mirroring the complexity of human communication. We develop the VG-SPICE dataset, crafted to challenge agents with visual scene graph construction from spoken conversational exchanges, highlighting speech and visual data integration. We also present the Audio-Vision Dialogue Scene Parser (AViD-SP) developed for use on VG-SPICE. These innovations aim to improve multimodal information processing and integration. Both the VG-SPICE dataset and the AViD-SP model are publicly available.",
    "authors": [
      "Jordan Voas",
      "Raymond Mooney",
      "David Harwath"
    ],
    "url": "http://arxiv.org/abs/2406.06438v1",
    "timestamp": 1718037094,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1141cf5e-8789-4ab2-877a-3f9b9b64b86b": {
    "pk": "1141cf5e-8789-4ab2-877a-3f9b9b64b86b",
    "title": "Spatiotemporal Graph Neural Network Modelling Perfusion MRI",
    "abstract": "Perfusion MRI (pMRI) offers valuable insights into tumor vascularity and promises to predict tumor genotypes, thus benefiting prognosis for glioma patients, yet effective models tailored to 4D pMRI are still lacking. This study presents the first attempt to model 4D pMRI using a GNN-based spatiotemporal model PerfGAT, integrating spatial information and temporal kinetics to predict Isocitrate DeHydrogenase (IDH) mutation status in glioma patients. Specifically, we propose a graph structure learning approach based on edge attention and negative graphs to optimize temporal correlations modeling. Moreover, we design a dual-attention feature fusion module to integrate spatiotemporal features while addressing tumor-related brain regions. Further, we develop a class-balanced augmentation methods tailored to spatiotemporal data, which could mitigate the common label imbalance issue in clinical datasets. Our experimental results demonstrate that the proposed method outperforms other state-of-the-art approaches, promising to model pMRI effectively for patient characterization.",
    "authors": [
      "Ruodan Yan",
      "Carola-Bibiane Schönlieb",
      "Chao Li"
    ],
    "url": "http://arxiv.org/abs/2406.06434v1",
    "timestamp": 1718036686,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.IV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f992c90a-de22-4634-9ef2-76d636571347": {
    "pk": "f992c90a-de22-4634-9ef2-76d636571347",
    "title": "DISCO: An End-to-End Bandit Framework for Personalised Discount Allocation",
    "abstract": "Personalised discount codes provide a powerful mechanism for managing customer relationships and operational spend in e-commerce. Bandits are well suited for this product area, given the partial information nature of the problem, as well as the need for adaptation to the changing business environment. Here, we introduce DISCO, an end-to-end contextual bandit framework for personalised discount code allocation at ASOS.com. DISCO adapts the traditional Thompson Sampling algorithm by integrating it within an integer program, thereby allowing for operational cost control. Because bandit learning is often worse with high dimensional actions, we focused on building low dimensional action and context representations that were nonetheless capable of good accuracy. Additionally, we sought to build a model that preserved the relationship between price and sales, in which customers increasing their purchasing in response to lower prices (\"negative price elasticity\"). These aims were achieved by using radial basis functions to represent the continuous (i.e. infinite armed) action space, in combination with context embeddings extracted from a neural network. These feature representations were used within a Thompson Sampling framework to facilitate exploration, and further integrated with an integer program to allocate discount codes across ASOS's customer base. These modelling decisions result in a reward model that (a) enables pooled learning across similar actions, (b) is highly accurate, including in extrapolation, and (c) preserves the expected negative price elasticity. Through offline analysis, we show that DISCO is able to effectively enact exploration and improves its performance over time, despite the global constraint. Finally, we subjected DISCO to a rigorous online A/B test, and find that it achieves a significant improvement of >1% in average basket value, relative to the legacy systems.",
    "authors": [
      "Jason Shuo Zhang",
      "Benjamin Howson",
      "Panayiota Savva",
      "Eleanor Loh"
    ],
    "url": "http://arxiv.org/abs/2406.06433v1",
    "timestamp": 1718036675,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c49e1e52-3407-4b9a-bf72-5431e16ccc38": {
    "pk": "c49e1e52-3407-4b9a-bf72-5431e16ccc38",
    "title": "Notes on Various Errors and Jacobian Derivations for SLAM",
    "abstract": "This paper delves into critical concepts and meticulous calculations pertinent to Simultaneous Localization and Mapping (SLAM), with a focus on error analysis and Jacobian matrices. We introduce various types of errors commonly encountered in SLAM, including reprojection error, photometric error, relative pose error, and line reprojection error, alongside their mathematical formulations. The fundamental role of error as the discrepancy between observed and predicted values in SLAM optimization is examined, emphasizing non-linear least squares methods for optimization.   We provide a detailed analysis of: - Reprojection Error: Including Jacobian calculations for camera poses and map points, highlighting both theoretical underpinnings and practical consequences. - Photometric Error: Addressing errors from image intensity variations, essential for direct method-based SLAM. - Relative Pose Error: Discussing its significance in pose graph optimization, especially in loop closure scenarios. The paper also presents extensive derivations of Jacobian matrices for various SLAM components such as camera poses, map points, and motion parameters. We explore the application of Lie theory to optimize rotation representations and transformations, improving computational efficiency. Specific software implementations are referenced, offering practical insights into the real-world application of these theories in SLAM systems.   Additionally, advanced topics such as line reprojection errors and IMU measurement errors are explored, discussing their impact on SLAM accuracy and performance. This comprehensive examination aims to enhance understanding and implementation of error analysis and Jacobian derivation in SLAM, contributing to more accurate and efficient state estimation in complex environments.",
    "authors": [
      "Gyubeom Im"
    ],
    "url": "http://arxiv.org/abs/2406.06422v1",
    "timestamp": 1718035991,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.RO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e85c5ab1-aa5c-4ea6-b749-3ac6e9c9a274": {
    "pk": "e85c5ab1-aa5c-4ea6-b749-3ac6e9c9a274",
    "title": "Random matchings in linear hypergraphs",
    "abstract": "For a given hypergraph $H$ and a vertex $v\\in V(H)$, consider a random matching $M$ chosen uniformly from the set of all matchings in $H.$ In $1995,$ Kahn conjectured that if $H$ is a $d$-regular linear $k$-uniform hypergraph, the probability that $M$ does not cover $v$ is $(1 + o_d(1))d^{-1/k}$ for all vertices $v\\in V(H).$ This conjecture was proved for $k = 2$ by Kahn and Kim in $1998.$   In this paper, we disprove this conjecture for all $k \\geq 3.$ For infinitely many values of $d,$ we construct $d$-regular linear $k$-uniform hypergraph $H$ containing two vertices $v_1$ and $v_2$ such that $\\mathcal{P}(v_1 \\notin M) = 1 - \\frac{(1 + o_d(1))}{d^{k-2}}$ and $\\mathcal{P}(v_2 \\notin M) = \\frac{(1 + o_d(1))}{d+1}.$ The gap between $\\mathcal{P}(v_1 \\notin M)$ and $\\mathcal{P}(v_2 \\notin M)$ in this $H$ is best possible. In the course of proving this, we also prove a hypergraph analog of Godsil's result on matching polynomials and paths in graphs, which is of independent interest.",
    "authors": [
      "Hyunwoo Lee"
    ],
    "url": "http://arxiv.org/abs/2406.06421v1",
    "timestamp": 1718035977,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "487c0755-25fe-4135-a169-a2dfa86754a1": {
    "pk": "487c0755-25fe-4135-a169-a2dfa86754a1",
    "title": "Foundation Inference Models for Markov Jump Processes",
    "abstract": "Markov jump processes are continuous-time stochastic processes which describe dynamical systems evolving in discrete state spaces. These processes find wide application in the natural sciences and machine learning, but their inference is known to be far from trivial. In this work we introduce a methodology for zero-shot inference of Markov jump processes (MJPs), on bounded state spaces, from noisy and sparse observations, which consists of two components. First, a broad probability distribution over families of MJPs, as well as over possible observation times and noise mechanisms, with which we simulate a synthetic dataset of hidden MJPs and their noisy observation process. Second, a neural network model that processes subsets of the simulated observations, and that is trained to output the initial condition and rate matrix of the target MJP in a supervised way. We empirically demonstrate that one and the same (pretrained) model can infer, in a zero-shot fashion, hidden MJPs evolving in state spaces of different dimensionalities. Specifically, we infer MJPs which describe (i) discrete flashing ratchet systems, which are a type of Brownian motors, and the conformational dynamics in (ii) molecular simulations, (iii) experimental ion channel data and (iv) simple protein folding models. What is more, we show that our model performs on par with state-of-the-art models which are finetuned to the target datasets.",
    "authors": [
      "David Berghaus",
      "Kostadin Cvejoski",
      "Patrick Seifner",
      "Cesar Ojeda",
      "Ramses J. Sanchez"
    ],
    "url": "http://arxiv.org/abs/2406.06419v1",
    "timestamp": 1718035920,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "af6164a9-63d2-488b-b074-62da519bb139": {
    "pk": "af6164a9-63d2-488b-b074-62da519bb139",
    "title": "Explainable Graph Neural Networks Under Fire",
    "abstract": "Predictions made by graph neural networks (GNNs) usually lack interpretability due to their complex computational behavior and the abstract nature of graphs. In an attempt to tackle this, many GNN explanation methods have emerged. Their goal is to explain a model's predictions and thereby obtain trust when GNN models are deployed in decision critical applications. Most GNN explanation methods work in a post-hoc manner and provide explanations in the form of a small subset of important edges and/or nodes. In this paper we demonstrate that these explanations can unfortunately not be trusted, as common GNN explanation methods turn out to be highly susceptible to adversarial perturbations. That is, even small perturbations of the original graph structure that preserve the model's predictions may yield drastically different explanations. This calls into question the trustworthiness and practical utility of post-hoc explanation methods for GNNs. To be able to attack GNN explanation models, we devise a novel attack method dubbed \\textit{GXAttack}, the first \\textit{optimization-based} adversarial attack method for post-hoc GNN explanations under such settings. Due to the devastating effectiveness of our attack, we call for an adversarial evaluation of future GNN explainers to demonstrate their robustness.",
    "authors": [
      "Zhong Li",
      "Simon Geisler",
      "Yuhang Wang",
      "Stephan Günnemann",
      "Matthijs van Leeuwen"
    ],
    "url": "http://arxiv.org/abs/2406.06417v1",
    "timestamp": 1718035756,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b94eba58-2276-4ea7-a6bf-2448a4c795b2": {
    "pk": "b94eba58-2276-4ea7-a6bf-2448a4c795b2",
    "title": "A LoRa-based Energy-efficient Sensing System for Urban Data Collection",
    "abstract": "Nowadays, cities provide much more than shopping opportunities or working spaces. Individual locations such as parks and squares are used as meeting points and local recreation areas by many people. To ensure that they remain attractive in the future, the design of such squares must be regularly adapted to the needs of the public. These utilization trends can be derived using public data collection. The more diverse and rich the data sets are, the easier it is to optimize public space design through data analysis. Traditional data collection methods such as questionnaires, observations, or videos are either labor intensive or cannot guarantee to preserve the individual's privacy. This work presents a privacy-preserving, low-power, and low-cost smart sensing system that is capable of anonymously collecting data about public space utilization by analyzing the occupancy distribution of public seating. To support future urban planning the sensor nodes are capable of monitoring environmental noise, chair utilization, and their position, temperature, and humidity and provide them over a city-wide Long Range Wide Area Network (LoRaWAN). The final sensing system's robust operation is proven in a trial run at two public squares in a city with 16 sensor nodes over a duration of two months. By consuming 33.65 mWh per day with all subsystems enabled, including sitting detection based on a continuous acceleration measurement operating on a robust and simple threshold algorithm, the custom-designed sensor node achieves continuous monitoring during the 2-month trial run. The evaluation of the experimental results clearly shows how the two locations are used, which confirms the practicability of the proposed solution. All data collected during the field trial is publicly available as open data.",
    "authors": [
      "Lukas Schulthess",
      "Tiago Salzmann",
      "Christian Vogt",
      "Michele Magno"
    ],
    "url": "http://arxiv.org/abs/2406.06404v1",
    "timestamp": 1718035053,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "cb169b75-556a-49d4-bf59-5252adc96ff6": {
    "pk": "cb169b75-556a-49d4-bf59-5252adc96ff6",
    "title": "Early Acceptance Matching Game for User-Centric Clustering in Scalable Cell-free MIMO Networks",
    "abstract": "The canonical setup is the primary approach adopted in cell-free multiple-input multiple-output (MIMO) networks, in which all access points (APs) jointly serve every user equipment (UE). This approach is not scalable in terms of computational complexity and fronthaul signaling becoming impractical in large networks. This work adopts a user-centric approach, a scalable alternative in which only a set of preferred APs jointly serve a UE. Forming the optimal cluster of APs for each UE is a challenging task, especially, when it needs to be dynamically adjusted to meet the quality of service (QoS) requirements of the UE. This complexity is even exacerbated when considering the constrained fronthaul capacity of the UE and the AP. We solve this problem with a novel many-to-many matching game. More specifically, we devise an early acceptance matching algorithm, which immediately admits or rejects UEs based on their requests and available radio resources. The proposed solution significantly reduces the fronthaul signaling while satisfying the maximum of UEs in terms of requested QoS compared to state-of-the-art approaches.",
    "authors": [
      "Ala Eddine Nouali",
      "Mohamed Sana",
      "Jean-Paul Jamont"
    ],
    "url": "http://arxiv.org/abs/2406.06402v1",
    "timestamp": 1718034974,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "d7bf4395-0ecd-410b-98b5-703e0b16a09e": {
    "pk": "d7bf4395-0ecd-410b-98b5-703e0b16a09e",
    "title": "Tackling Delayed CSI in a Distributed Multi-Satellite MIMO Communication System",
    "abstract": "In this study, we explore the integration of satellites with ground-based communication networks. Specifically, we analyze downlink data transmission from a constellation of satellites to terrestrial users and address the issue of delayed channel state information (CSI). The satellites cooperate in data transmission within a cluster to create a unified, distributed massive multiple input, multiple output (MIMO) system. The CSI used for this process is inherently outdated, particularly due to the delay from the most distant satellite in the cluster. Therefore, in this paper, we develop a precoding strategy that leverages the long-term characteristics of CSI uncertainty to compensate for the undesirable impact of these unavoidable delays. Our proposed method is computationally efficient and particularly effective in lower frequency bands. As such, it holds significant promise for facilitating the integration of satellite and terrestrial communication, especially within frequency bands of up to 1 GHz.",
    "authors": [
      "Yasaman Omid",
      "Sangarapillai Lambotharan",
      "Mahsa Derakhshani"
    ],
    "url": "http://arxiv.org/abs/2406.06392v1",
    "timestamp": 1718034403,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "953288a2-ec8b-4ecf-8a5a-7ea73f12bb72": {
    "pk": "953288a2-ec8b-4ecf-8a5a-7ea73f12bb72",
    "title": "Time-tronics: from temporal printed circuit board to quantum computer",
    "abstract": "Time crystalline structures can be created in periodically driven systems. They are temporal lattices which can reveal different condensed matter behaviours ranging from Anderson localization in time to temporal analogues of many-body localization or topological insulators. However, the potential practical applications of time crystalline structures have yet to be explored. Here, we pave the way for time-tronics where temporal lattices are like printed circuit boards for realization of a broad range of quantum devices. The elements of these devices can correspond to structures of dimensions higher than three and can be arbitrarily connected and reconfigured at any moment. Moreover, our approach allows for the construction of a quantum computer, enabling quantum gate operations for all possible pairs of qubits. Our findings indicate that the limitations faced in building devices using conventional spatial crystals can be overcome by adopting crystalline structures in time.",
    "authors": [
      "Krzysztof Giergiel",
      "Peter Hannaford",
      "Krzysztof Sacha"
    ],
    "url": "http://arxiv.org/abs/2406.06387v1",
    "timestamp": 1718034289,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.quant-gas",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "363e7588-8165-4886-9558-85a0eef0cab0": {
    "pk": "363e7588-8165-4886-9558-85a0eef0cab0",
    "title": "The number of connected components in sub-critical random graph processes",
    "abstract": "We present a detailed study of the evolution of the number of connected components in sub-critical multiplicative random graph processes. We consider a model where edges appear independently after an exponential time at rate equal to the product of the sizes of the vertices. We provide an explicit expression for the fluid limit of the number of connected components normalized by its initial value, when the time is smaller than the inverse of the sum of the square of the initial vertex sizes. We also identify the diffusion limit of the rescaled fluctuations around the fluid limit. This is applied to several examples. In the particular setting of the Erd\\H{o}s-R\\'enyi graph process, we explicit the fluid limit of the number of connected components normalized, and the diffusion limit of the scaled fluctuations in the sub-critical regime, where the mean degree is between zero and one.",
    "authors": [
      "Josué Corujo"
    ],
    "url": "http://arxiv.org/abs/2406.06380v1",
    "timestamp": 1718034025,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.PR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "05c5f7c6-eca2-4659-91bb-323af9d0714f": {
    "pk": "05c5f7c6-eca2-4659-91bb-323af9d0714f",
    "title": "Improving Deep Learning-based Automatic Cranial Defect Reconstruction by Heavy Data Augmentation: From Image Registration to Latent Diffusion Models",
    "abstract": "Modeling and manufacturing of personalized cranial implants are important research areas that may decrease the waiting time for patients suffering from cranial damage. The modeling of personalized implants may be partially automated by the use of deep learning-based methods. However, this task suffers from difficulties with generalizability into data from previously unseen distributions that make it difficult to use the research outcomes in real clinical settings. Due to difficulties with acquiring ground-truth annotations, different techniques to improve the heterogeneity of datasets used for training the deep networks have to be considered and introduced. In this work, we present a large-scale study of several augmentation techniques, varying from classical geometric transformations, image registration, variational autoencoders, and generative adversarial networks, to the most recent advances in latent diffusion models. We show that the use of heavy data augmentation significantly increases both the quantitative and qualitative outcomes, resulting in an average Dice Score above 0.94 for the SkullBreak and above 0.96 for the SkullFix datasets. Moreover, we show that the synthetically augmented network successfully reconstructs real clinical defects. The work is a considerable contribution to the field of artificial intelligence in the automatic modeling of personalized cranial implants.",
    "authors": [
      "Marek Wodzinski",
      "Kamil Kwarciak",
      "Mateusz Daniol",
      "Daria Hemmerling"
    ],
    "url": "http://arxiv.org/abs/2406.06372v1",
    "timestamp": 1718033663,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "3f72bc92-9537-405a-a4fc-c53164dad90f": {
    "pk": "3f72bc92-9537-405a-a4fc-c53164dad90f",
    "title": "Error Analysis and Numerical Algorithm for PDE Approximation with Hidden-Layer Concatenated Physics Informed Neural Networks",
    "abstract": "We present the hidden-layer concatenated physics informed neural network (HLConcPINN) method, which combines hidden-layer concatenated feed-forward neural networks, a modified block time marching strategy, and a physics informed approach for approximating partial differential equations (PDEs). We analyze the convergence properties and establish the error bounds of this method for two types of PDEs: parabolic (exemplified by the heat and Burgers' equations) and hyperbolic (exemplified by the wave and nonlinear Klein-Gordon equations). We show that its approximation error of the solution can be effectively controlled by the training loss for dynamic simulations with long time horizons. The HLConcPINN method in principle allows an arbitrary number of hidden layers not smaller than two and any of the commonly-used smooth activation functions for the hidden layers beyond the first two, with theoretical guarantees. This generalizes several recent neural-network techniques, which have theoretical guarantees but are confined to two hidden layers in the network architecture and the $\\tanh$ activation function. Our theoretical analyses subsequently inform the formulation of appropriate training loss functions for these PDEs, leading to physics informed neural network (PINN) type computational algorithms that differ from the standard PINN formulation. Ample numerical experiments are presented based on the proposed algorithm to validate the effectiveness of this method and confirm aspects of the theoretical analyses.",
    "authors": [
      "Yianxia Qian",
      "Yongchao Zhang",
      "Suchuan Dong"
    ],
    "url": "http://arxiv.org/abs/2406.06350v1",
    "timestamp": 1718032373,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.NA",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4cfba8ae-c29d-447c-a244-c1db8ccbb64b": {
    "pk": "4cfba8ae-c29d-447c-a244-c1db8ccbb64b",
    "title": "Causal Discovery over High-Dimensional Structured Hypothesis Spaces with Causal Graph Partitioning",
    "abstract": "The aim in many sciences is to understand the mechanisms that underlie the observed distribution of variables, starting from a set of initial hypotheses. Causal discovery allows us to infer mechanisms as sets of cause and effect relationships in a generalized way -- without necessarily tailoring to a specific domain. Causal discovery algorithms search over a structured hypothesis space, defined by the set of directed acyclic graphs, to find the graph that best explains the data. For high-dimensional problems, however, this search becomes intractable and scalable algorithms for causal discovery are needed to bridge the gap. In this paper, we define a novel causal graph partition that allows for divide-and-conquer causal discovery with theoretical guarantees. We leverage the idea of a superstructure -- a set of learned or existing candidate hypotheses -- to partition the search space. We prove under certain assumptions that learning with a causal graph partition always yields the Markov Equivalence Class of the true causal graph. We show our algorithm achieves comparable accuracy and a faster time to solution for biologically-tuned synthetic networks and networks up to ${10^4}$ variables. This makes our method applicable to gene regulatory network inference and other domains with high-dimensional structured hypothesis spaces.",
    "authors": [
      "Ashka Shah",
      "Adela DePavia",
      "Nathaniel Hudson",
      "Ian Foster",
      "Rick Stevens"
    ],
    "url": "http://arxiv.org/abs/2406.06348v1",
    "timestamp": 1718032094,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2533c4ee-c70d-486d-83d9-e4ab2402b996": {
    "pk": "2533c4ee-c70d-486d-83d9-e4ab2402b996",
    "title": "Dynamical Mean-Field Theory of Complex Systems on Sparse Directed Networks",
    "abstract": "Although real-world complex systems typically interact through sparse and heterogeneous networks, analytic solutions of their dynamics are limited to models with all-to-all interactions. Here, we solve the dynamics of a broad range of nonlinear models of complex systems on sparse directed networks with a random structure. By generalizing dynamical mean-field theory to sparse systems, we derive an exact equation for the path-probability describing the effective dynamics of a single degree of freedom. Our general solution applies to key models in the study of neural networks, ecosystems, epidemic spreading, and synchronization. Using the population dynamics algorithm, we solve the path-probability equation to determine the phase diagram of a seminal neural network model in the sparse regime, showing that this model undergoes a transition from a fixed-point phase to chaos as a function of the network topology.",
    "authors": [
      "Fernando L. Metz"
    ],
    "url": "http://arxiv.org/abs/2406.06346v1",
    "timestamp": 1718031962,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.dis-nn",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b1384dc5-e762-4953-8207-9a5656130087": {
    "pk": "b1384dc5-e762-4953-8207-9a5656130087",
    "title": "Audio-based Step-count Estimation for Running -- Windowing and Neural Network Baselines",
    "abstract": "In recent decades, running has become an increasingly popular pastime activity due to its accessibility, ease of practice, and anticipated health benefits. However, the risk of running-related injuries is substantial for runners of different experience levels. Several common forms of injuries result from overuse -- extending beyond the recommended running time and intensity. Recently, audio-based tracking has emerged as yet another modality for monitoring running behaviour and performance, with previous studies largely concentrating on predicting runner fatigue. In this work, we investigate audio-based step count estimation during outdoor running, achieving a mean absolute error of 1.098 in window-based step-count differences and a Pearson correlation coefficient of 0.479 when predicting the number of steps in a 5-second window of audio. Our work thus showcases the feasibility of audio-based monitoring for estimating important physiological variables and lays the foundations for further utilising audio sensors for a more thorough characterisation of runner behaviour.",
    "authors": [
      "Philipp Wagner",
      "Andreas Triantafyllopoulos",
      "Alexander Gebhard",
      "Björn Schuller"
    ],
    "url": "http://arxiv.org/abs/2406.06339v1",
    "timestamp": 1718031541,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.SD",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "7ab07a88-16f1-4187-bf0b-e55c14c3ccd6": {
    "pk": "7ab07a88-16f1-4187-bf0b-e55c14c3ccd6",
    "title": "System- and Sample-agnostic Isotropic 3D Microscopy by Weakly Physics-informed, Domain-shift-resistant Axial Deblurring",
    "abstract": "Three-dimensional (3D) subcellular imaging is essential for biomedical research, but the diffraction limit of optical microscopy compromises axial resolution, hindering accurate 3D structural analysis. This challenge is particularly pronounced in label-free imaging of thick, heterogeneous tissues, where assumptions about data distribution (e.g. sparsity, label-specific distribution, and lateral-axial similarity) and system priors (e.g. independent and identically distributed (i.i.d.) noise and linear shift-invariant (LSI) point-spread functions (PSFs)) are often invalid. Here, we introduce SSAI-3D, a weakly physics-informed, domain-shift-resistant framework for robust isotropic 3D imaging. SSAI-3D enables robust axial deblurring by generating a PSF-flexible, noise-resilient, sample-informed training dataset and sparsely fine-tuning a large pre-trained blind deblurring network. SSAI-3D was applied to label-free nonlinear imaging of living organoids, freshly excised human endometrium tissue, and mouse whisker pads, and further validated in publicly available ground-truth-paired experimental datasets of 3D heterogeneous biological tissues with unknown blurring and noise across different microscopy systems.",
    "authors": [
      "Jiashu Han",
      "Kunzan Liu",
      "Keith B. Isaacson",
      "Kristina Monakhova",
      "Linda G. Griffith",
      "Sixian You"
    ],
    "url": "http://arxiv.org/abs/2406.06337v1",
    "timestamp": 1718031455,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "physics.optics",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "a94f93ef-fd34-4a2f-9c25-2c00cd7c4a4b": {
    "pk": "a94f93ef-fd34-4a2f-9c25-2c00cd7c4a4b",
    "title": "An automatic analysis of ultrasound vocalisations for the prediction of interaction context in captive Egyptian fruit bats",
    "abstract": "Prior work in computational bioacoustics has mostly focused on the detection of animal presence in a particular habitat. However, animal sounds contain much richer information than mere presence; among others, they encapsulate the interactions of those animals with other members of their species. Studying these interactions is almost impossible in a naturalistic setting, as the ground truth is often lacking. The use of animals in captivity instead offers a viable alternative pathway. However, most prior works follow a traditional, statistics-based approach to analysing interactions. In the present work, we go beyond this standard framework by attempting to predict the underlying context in interactions between captive \\emph{Rousettus Aegyptiacus} using deep neural networks. We reach an unweighted average recall of over 30\\% -- more than thrice the chance level -- and show error patterns that differ from our statistical analysis. This work thus represents an important step towards the automatic analysis of states in animals from sound.",
    "authors": [
      "Andreas Triantafyllopoulos",
      "Alexander Gebhard",
      "Manuel Milling",
      "Simon Rampp",
      "Björn Schuller"
    ],
    "url": "http://arxiv.org/abs/2406.06332v1",
    "timestamp": 1718031032,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.SD",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ff3499fc-682e-477d-8674-4de098090bc9": {
    "pk": "ff3499fc-682e-477d-8674-4de098090bc9",
    "title": "Leveraging Hyperscanning EEG and VR Omnidirectional Treadmill to Explore Inter-Brain Synchrony in Collaborative Spatial Navigation",
    "abstract": "Navigating through a physical environment to reach a desired location involves a complex interplay of cognitive, sensory, and motor functions. When navigating with others, experiencing a degree of behavioral and cognitive synchronization is both natural and ubiquitous. This synchronization facilitates a harmonious effort toward achieving a common goal, reflecting how individuals instinctively align their actions and thoughts in collaborative settings. Collaborative spatial tasks, which are crucial in daily and professional settings, require coordinated navigation and problem-solving skills. This study explores the neural mechanisms underlying such tasks by using hyperscanning electroencephalography (EEG) technology to examine brain dynamics in dyadic route planning within a virtual reality setting. By analyzing intra- and inter-brain couplings across delta, theta, alpha, beta, and gamma EEG bands using both functional and effective connectivity measures, we identified significant neural synchronization patterns associated with collaborative task performance in both leaders and followers. Functional intra-brain connectivity analyses revealed distinct neural engagement across EEG frequency bands, with increased delta couplings observed in both leaders and followers. Theta connectivity was particularly enhanced in followers, whereas the alpha band exhibited divergent patterns that indicate role-specific neural strategies. Inter-brain analysis revealed increased delta causality between interacting members but decreased theta and gamma couplings from followers to leaders. Additionally, inter-brain analysis indicated decreased couplings in faster-performing dyads, especially in theta bands. These insights enhance our understanding of the neural mechanisms driving collaborative spatial navigation and demonstrate the effectiveness of hyperscanning in studying complex brain-to-brain interactions.",
    "authors": [
      "Chun-Hsiang Chuang",
      "Po-Hsun Peng",
      "Yi-Chieh Chen"
    ],
    "url": "http://arxiv.org/abs/2406.06327v1",
    "timestamp": 1718030557,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "q-bio.NC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fab64edf-7b00-4e2d-af56-41ef424b1a61": {
    "pk": "fab64edf-7b00-4e2d-af56-41ef424b1a61",
    "title": "Optimal Preprocessing for Answering On-Line Product Queries",
    "abstract": "We examine the amount of preprocessing needed for answering certain on-line queries as fast as possible. We start with the following basic problem. Suppose we are given a semigroup $(S,\\circ )$. Let $s_1 ,\\ldots, s_n$ be elements of $S$. We want to answer on-line queries of the form, ``What is the product $s_i \\circ s_{i+1} \\circ \\cdots \\circ s_{j-1} \\circ s_j$?'' for any given $1\\le i\\le j\\le n$. We show that a preprocessing of $\\Theta(n \\lambda (k,n))$ time and space is both necessary and sufficient to answer each such query in at most $k$ steps, for any fixed $k$. The function $\\lambda (k,\\cdot)$ is the inverse of a certain function at the $\\lfloor {k/2}\\rfloor$-th level of the primitive recursive hierarchy. In case linear preprocessing is desired, we show that one can answer each such query in $O( \\alpha (n))$ steps and that this is best possible. The function $\\alpha (n)$ is the inverse Ackermann function.   We also consider the following extended problem. Let $T$ be a tree with an element of $S$ associated with each of its vertices. We want to answer on-line queries of the form, ``What is the product of the elements associated with the vertices along the path from $u$ to $v$?'' for any pair of vertices $u$ and $v$ in $T$. We derive results that are similar to the above, for the preprocessing needed for answering such queries.   All our sequential preprocessing algorithms can be parallelized efficiently to give optimal parallel algorithms which run in $O(\\log n)$ time on a CREW PRAM. These parallel algorithms are optimal in both running time and total number of operations.   Our algorithms, especially for the semigroup of the real numbers with the minimum or maximum operations, have various applications in certain graph algorithms, in the utilization of communication networks and in Database retrieval.",
    "authors": [
      "Noga Alon",
      "Baruch Schieber"
    ],
    "url": "http://arxiv.org/abs/2406.06321v1",
    "timestamp": 1718030218,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.DS",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "430ef293-2d49-485a-992e-1d9c76791573": {
    "pk": "430ef293-2d49-485a-992e-1d9c76791573",
    "title": "On the structure and diameter of graph associahedra of graphs with a set of true twins",
    "abstract": "Given a graph $G$, the graph associahedron $\\mathcal{A}(G)$ is a polytope whose 1-skeleton is the rotation graph of $G$, that is, the 1-skeleton of $\\mathcal{A}(G)$ is the graph $\\mathcal{R}(G)$ whose vertices are the search trees on $G$ and whose edges correspond to an application of a local operation on the search trees, called rotation. The rotation distance between two search trees on $G$ is the minimum number of rotations needed to transform one of the trees into the other. A challenging question is what is the maximum rotation distance between search trees on a graph, i.e. what is the combinatorial diameter of the corresponding graph associahedron. In this paper we study the relation between the structure of $\\mathcal{R}(G)$ and $\\mathcal{R}(G-S)$ for a particular choice of $S\\subseteq E(G)$. More specifically, we show that if $W$ is a set of true twins in $G$ and $S$ is the set of edges in $G$ with both endpoints in $W$, then $\\mathcal{R}(G-S)$ is a quotient graph of $\\mathcal{R}(G)$. We also give a lower bound for $\\text{diam} (\\mathcal{R}(G-S))$ in terms of $\\text{diam}(\\mathcal{R}(G))$. As a consequence, we obtain a new lower bound for the diameter of the graph associahedra of balanced complete bipartite graphs that allow us to compute the exact value of $\\text{diam}(\\mathcal{R}(K_{2,q}))$ for $q\\in\\{3,4,5,6,7,8\\}$.",
    "authors": [
      "Ana Gargantini",
      "Adrián Pastine",
      "Pablo Torres"
    ],
    "url": "http://arxiv.org/abs/2406.06317v1",
    "timestamp": 1718030039,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "30fb5152-54df-4374-b36e-0af88d61c8c6": {
    "pk": "30fb5152-54df-4374-b36e-0af88d61c8c6",
    "title": "Should my Blockchain Learn to Drive? A Study of Hyperledger Fabric",
    "abstract": "Similar to other transaction processing frameworks, blockchain systems need to be dynamically reconfigured to adapt to varying workloads and changes in network conditions. However, achieving optimal reconfiguration is particularly challenging due to the complexity of the blockchain stack, which has diverse configurable parameters. This paper explores the concept of self-driving blockchains, which have the potential to predict workload changes and reconfigure themselves for optimal performance without human intervention. We compare and contrast our discussions with existing research on databases and highlight aspects unique to blockchains. We identify specific parameters and components in Hyperledger Fabric, a popular permissioned blockchain system, that are suitable for autonomous adaptation and offer potential solutions for the challenges involved. Further, we implement three demonstrative locally autonomous systems, each targeting a different layer of the blockchain stack, and conduct experiments to understand the feasibility of our findings. Our experiments indicate up to 11% improvement in success throughput and a 30% decrease in latency, making this a significant step towards implementing a fully autonomous blockchain system in the future.",
    "authors": [
      "Jeeta Ann Chacko",
      "Ruben Mayer",
      "Hans-Arno Jacobsen"
    ],
    "url": "http://arxiv.org/abs/2406.06318v1",
    "timestamp": 1718030039,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.DC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2621780e-b361-411b-a649-a3cf3e862786": {
    "pk": "2621780e-b361-411b-a649-a3cf3e862786",
    "title": "ProAct: Progressive Training for Hybrid Clipped Activation Function to Enhance Resilience of DNNs",
    "abstract": "Deep Neural Networks (DNNs) are extensively employed in safety-critical applications where ensuring hardware reliability is a primary concern. To enhance the reliability of DNNs against hardware faults, activation restriction techniques significantly mitigate the fault effects at the DNN structure level, irrespective of accelerator architectures. State-of-the-art methods offer either neuron-wise or layer-wise clipping activation functions. They attempt to determine optimal clipping thresholds using heuristic and learning-based approaches. Layer-wise clipped activation functions cannot preserve DNNs resilience at high bit error rates. On the other hand, neuron-wise clipping activation functions introduce considerable memory overhead due to the addition of parameters, which increases their vulnerability to faults. Moreover, the heuristic-based optimization approach demands numerous fault injections during the search process, resulting in time-consuming threshold identification. On the other hand, learning-based techniques that train thresholds for entire layers concurrently often yield sub-optimal results. In this work, first, we demonstrate that it is not essential to incorporate neuron-wise activation functions throughout all layers in DNNs. Then, we propose a hybrid clipped activation function that integrates neuron-wise and layer-wise methods that apply neuron-wise clipping only in the last layer of DNNs. Additionally, to attain optimal thresholds in the clipping activation function, we introduce ProAct, a progressive training methodology. This approach iteratively trains the thresholds on a layer-by-layer basis, aiming to obtain optimal threshold values in each layer separately.",
    "authors": [
      "Seyedhamidreza Mousavi",
      "Mohammad Hasan Ahmadilivani",
      "Jaan Raik",
      "Maksim Jenihhin",
      "Masoud Daneshtalab"
    ],
    "url": "http://arxiv.org/abs/2406.06313v1",
    "timestamp": 1718029898,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "979ef47e-3210-4c3f-8a4e-bb395040c1c0": {
    "pk": "979ef47e-3210-4c3f-8a4e-bb395040c1c0",
    "title": "Unsupervised Improved MVDR Beamforming for Sound Enhancement",
    "abstract": "Neural networks have recently become the dominant approach to sound separation. Their good performance relies on large datasets of isolated recordings. For speech and music, isolated single channel data are readily available; however the same does not hold in the multi-channel case, and with most other sound classes. Multi-channel methods have the potential to outperform single channel approaches as they can exploit both spatial and spectral features, but the lack of training data remains a challenge. We propose unsupervised improved minimum variation distortionless response (UIMVDR), which enables multi-channel separation to leverage in-the-wild single-channel data through unsupervised training and beamforming. Results show that UIMVDR generalizes well and improves separation performance compared to supervised models, particularly in cases with limited supervised data. By using data available online, it also reduces the effort required to gather data for multi-channel approaches.",
    "authors": [
      "Jacob Kealey",
      "John Hershey",
      "François Grondin"
    ],
    "url": "http://arxiv.org/abs/2406.06310v1",
    "timestamp": 1718029569,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.SD",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "97c903a0-188b-4b92-a03c-1a41b2f9c7b3": {
    "pk": "97c903a0-188b-4b92-a03c-1a41b2f9c7b3",
    "title": "Is Value Functions Estimation with Classification Plug-and-play for Offline Reinforcement Learning?",
    "abstract": "In deep Reinforcement Learning (RL), value functions are typically approximated using deep neural networks and trained via mean squared error regression objectives to fit the true value functions. Recent research has proposed an alternative approach, utilizing the cross-entropy classification objective, which has demonstrated improved performance and scalability of RL algorithms. However, existing study have not extensively benchmarked the effects of this replacement across various domains, as the primary objective was to demonstrate the efficacy of the concept across a broad spectrum of tasks, without delving into in-depth analysis. Our work seeks to empirically investigate the impact of such a replacement in an offline RL setup and analyze the effects of different aspects on performance. Through large-scale experiments conducted across a diverse range of tasks using different algorithms, we aim to gain deeper insights into the implications of this approach. Our results reveal that incorporating this change can lead to superior performance over state-of-the-art solutions for some algorithms in certain tasks, while maintaining comparable performance levels in other tasks, however for other algorithms this modification might lead to the dramatic performance drop. This findings are crucial for further application of classification approach in research and practical tasks.",
    "authors": [
      "Denis Tarasov",
      "Kirill Brilliantov",
      "Dmitrii Kharlapenko"
    ],
    "url": "http://arxiv.org/abs/2406.06309v1",
    "timestamp": 1718029511,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f4e5025d-d095-4786-91c7-dc136f8b149e": {
    "pk": "f4e5025d-d095-4786-91c7-dc136f8b149e",
    "title": "Building Continuous Quantum-Classical Bayesian Neural Networks for a Classical Clinical Dataset",
    "abstract": "In this work, we are introducing a Quantum-Classical Bayesian Neural Network (QCBNN) that is capable to perform uncertainty-aware classification of classical medical dataset. This model is a symbiosis of a classical Convolutional NN that performs ultra-sound image processing and a quantum circuit that generates its stochastic weights, within a Bayesian learning framework. To test the utility of this idea for the possible future deployment in the medical sector we track multiple behavioral metrics that capture both predictive performance as well as model's uncertainty. It is our ambition to create a hybrid model that is capable to classify samples in a more uncertainty aware fashion, which will advance the trustworthiness of these models and thus bring us step closer to utilizing them in the industry. We test multiple setups for quantum circuit for this task, and our best architectures display bigger uncertainty gap between correctly and incorrectly identified samples than its classical benchmark at an expense of a slight drop in predictive performance. The innovation of this paper is two-fold: (1) combining of different approaches that allow the stochastic weights from the quantum circuit to be continues thus allowing the model to classify application-driven dataset; (2) studying architectural features of quantum circuit that make-or-break these models, which pave the way into further investigation of more informed architectural designs.",
    "authors": [
      "Alona Sakhnenko",
      "Julian Sikora",
      "Jeanette Miriam Lorenz"
    ],
    "url": "http://arxiv.org/abs/2406.06307v1",
    "timestamp": 1718029405,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "quant-ph",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c229bf0a-f2ad-41fb-a717-1a6134fc6b6e": {
    "pk": "c229bf0a-f2ad-41fb-a717-1a6134fc6b6e",
    "title": "Unified Fourier bases for GSP on stochastic block model graphs",
    "abstract": "We consider a recently proposed approach to graph signal processing based on graphons. We show how the graphon-based approach to GSP applies to graphs sampled from a stochastic block model. We obtain a basis for the graphon Fourier transform on such samples directly from the link probability matrix and the block sizes of the model. This formulation allows us to bound the sensitivity of the Fourier transform to small changes in block sizes. We then focus on the case where the probability matrix corresponds to a (weighted) Cayley graph. If block sizes are equal, a nice Fourier basis can be derived from the underlying group. We explore how, in the case where block sizes are not equal, some or all nice properties of the group basis can be maintained. We complement the theoretical results with simulations.",
    "authors": [
      "Mahya Ghandehari",
      "Jeannette Janssen",
      "Silo Murphy"
    ],
    "url": "http://arxiv.org/abs/2406.06306v1",
    "timestamp": 1718029301,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SP",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "813e89ef-cbbd-4d9e-9619-4f80f33600ce": {
    "pk": "813e89ef-cbbd-4d9e-9619-4f80f33600ce",
    "title": "NeuroMoCo: A Neuromorphic Momentum Contrast Learning Method for Spiking Neural Networks",
    "abstract": "Recently, brain-inspired spiking neural networks (SNNs) have attracted great research attention owing to their inherent bio-interpretability, event-triggered properties and powerful perception of spatiotemporal information, which is beneficial to handling event-based neuromorphic datasets. In contrast to conventional static image datasets, event-based neuromorphic datasets present heightened complexity in feature extraction due to their distinctive time series and sparsity characteristics, which influences their classification accuracy. To overcome this challenge, a novel approach termed Neuromorphic Momentum Contrast Learning (NeuroMoCo) for SNNs is introduced in this paper by extending the benefits of self-supervised pre-training to SNNs to effectively stimulate their potential. This is the first time that self-supervised learning (SSL) based on momentum contrastive learning is realized in SNNs. In addition, we devise a novel loss function named MixInfoNCE tailored to their temporal characteristics to further increase the classification accuracy of neuromorphic datasets, which is verified through rigorous ablation experiments. Finally, experiments on DVS-CIFAR10, DVS128Gesture and N-Caltech101 have shown that NeuroMoCo of this paper establishes new state-of-the-art (SOTA) benchmarks: 83.6% (Spikformer-2-256), 98.62% (Spikformer-2-256), and 84.4% (SEW-ResNet-18), respectively.",
    "authors": [
      "Yuqi Ma",
      "Huamin Wang",
      "Hangchi Shen",
      "Xuemei Chen",
      "Shukai Duan",
      "Shiping Wen"
    ],
    "url": "http://arxiv.org/abs/2406.06305v1",
    "timestamp": 1718029248,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f12c65bc-7a1c-43b4-adf1-fb18709ca14a": {
    "pk": "f12c65bc-7a1c-43b4-adf1-fb18709ca14a",
    "title": "Sample Rate Independent Recurrent Neural Networks for Audio Effects Processing",
    "abstract": "In recent years, machine learning approaches to modelling guitar amplifiers and effects pedals have been widely investigated and have become standard practice in some consumer products. In particular, recurrent neural networks (RNNs) are a popular choice for modelling non-linear devices such as vacuum tube amplifiers and distortion circuitry. One limitation of such models is that they are trained on audio at a specific sample rate and therefore give unreliable results when operating at another rate. Here, we investigate several methods of modifying RNN structures to make them approximately sample rate independent, with a focus on oversampling. In the case of integer oversampling, we demonstrate that a previously proposed delay-based approach provides high fidelity sample rate conversion whilst additionally reducing aliasing. For non-integer sample rate adjustment, we propose two novel methods and show that one of these, based on cubic Lagrange interpolation of a delay-line, provides a significant improvement over existing methods. To our knowledge, this work provides the first in-depth study into this problem.",
    "authors": [
      "Alistair Carson",
      "Alec Wright",
      "Jatin Chowdhury",
      "Vesa Välimäki",
      "Stefan Bilbao"
    ],
    "url": "http://arxiv.org/abs/2406.06293v1",
    "timestamp": 1718028863,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.AS",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "eec8e632-588d-4656-9b7c-eb0cd1f98318": {
    "pk": "eec8e632-588d-4656-9b7c-eb0cd1f98318",
    "title": "Modeling inclusive electron-nucleus scattering with Bayesian artificial neural networks",
    "abstract": "We introduce a Bayesian protocol based on artificial neural networks that is suitable for modeling inclusive electron-nucleus scattering on a variety of nuclear targets with quantified uncertainties. Unlike previous applications in the field, which directly parameterize the cross sections, our approach employs artificial neural networks to represent the longitudinal and transverse response functions. In contrast to cross sections, which depend on the incoming energy, scattering angle, and energy transfer, the response functions are determined solely by the energy and momentum transfer to the system, allowing the angular component to be treated analytically. We assess the accuracy and predictive power of our framework against the extensive data in the quasielastic inclusive electron-scattering database. Additionally, we present novel extractions of the longitudinal and transverse response functions and compare them with previous experimental analysis and nuclear ab-initio calculations.",
    "authors": [
      "Joanna E. Sobczyk",
      "Noemi Rocco",
      "Alessandro Lovato"
    ],
    "url": "http://arxiv.org/abs/2406.06292v1",
    "timestamp": 1718028809,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "nucl-th",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "026c4a56-8957-42c6-b73d-6ccb55b37423": {
    "pk": "026c4a56-8957-42c6-b73d-6ccb55b37423",
    "title": "Geometric sparsification in recurrent neural networks",
    "abstract": "A common technique for ameliorating the computational costs of running large neural models is sparsification, or the removal of neural connections during training. Sparse models are capable of maintaining the high accuracy of state of the art models, while functioning at the cost of more parsimonious models. The structures which underlie sparse architectures are, however, poorly understood and not consistent between differently trained models and sparsification schemes. In this paper, we propose a new technique for sparsification of recurrent neural nets (RNNs), called moduli regularization, in combination with magnitude pruning. Moduli regularization leverages the dynamical system induced by the recurrent structure to induce a geometric relationship between neurons in the hidden state of the RNN. By making our regularizing term explicitly geometric, we provide the first, to our knowledge, a priori description of the desired sparse architecture of our neural net. We verify the effectiveness of our scheme for navigation and natural language processing RNNs. Navigation is a structurally geometric task, for which there are known moduli spaces, and we show that regularization can be used to reach 90% sparsity while maintaining model performance only when coefficients are chosen in accordance with a suitable moduli space. Natural language processing, however, has no known moduli space in which computations are performed. Nevertheless, we show that moduli regularization induces more stable recurrent neural nets with a variety of moduli regularizers, and achieves high fidelity models at 98% sparsity.",
    "authors": [
      "Wyatt Mackey",
      "Ioannis Schizas",
      "Jared Deighton",
      "David L. Boothe, Jr.",
      "Vasileios Maroulas"
    ],
    "url": "http://arxiv.org/abs/2406.06290v1",
    "timestamp": 1718028753,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "415117e5-ff0f-4369-883c-f8565213da39": {
    "pk": "415117e5-ff0f-4369-883c-f8565213da39",
    "title": "VS-PINN: A Fast and efficient training of physics-informed neural networks using variable-scaling methods for solving PDEs with stiff behavior",
    "abstract": "Physics-informed neural networks (PINNs) have recently emerged as a promising way to compute the solutions of partial differential equations (PDEs) using deep neural networks. However, despite their significant success in various fields, it remains unclear in many aspects how to effectively train PINNs if the solutions of PDEs exhibit stiff behaviors or high frequencies. In this paper, we propose a new method for training PINNs using variable-scaling techniques. This method is simple and it can be applied to a wide range of problems including PDEs with rapidly-varying solutions. Throughout various numerical experiments, we will demonstrate the effectiveness of the proposed method for these problems and confirm that it can significantly improve the training efficiency and performance of PINNs. Furthermore, based on the analysis of the neural tangent kernel (NTK), we will provide theoretical evidence for this phenomenon and show that our methods can indeed improve the performance of PINNs.",
    "authors": [
      "Seungchan Ko",
      "Sang Hyeon Park"
    ],
    "url": "http://arxiv.org/abs/2406.06287v1",
    "timestamp": 1718028675,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.NA",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "944a1d91-7429-4e56-9113-3d10ac59b563": {
    "pk": "944a1d91-7429-4e56-9113-3d10ac59b563",
    "title": "Constructions of graphs with any possible two-fold automorphism and automorphism groups",
    "abstract": "It is known that the canonical double cover of any connected nonbipartite graph have an automorphism group of the form $H \\rtimes \\mathbb{Z}_2$, where $H$ is the set of automorphism which preserve bipartite parts. We construct connected nonbipartite and vertex determining graphs whose canonical double covers have auromorphisms group isomorphic to any semisimple product of $\\mathbb{Z}_2$ with any abstract group $H$. Later we show, that the canonical double cover of any asymmetric graph have abelian automorphisms group of odd order. The above construction provides an example of asymmetric graph for any such group. By modifying the aforementioned construction we obtain graphs which have any possible number and type of graphs with isomorphic double covers.",
    "authors": [
      "Bartłomiej Bychawski"
    ],
    "url": "http://arxiv.org/abs/2406.06267v1",
    "timestamp": 1718027445,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "21e1d8af-2cb9-47f3-8904-f9b3b22c2ea4": {
    "pk": "21e1d8af-2cb9-47f3-8904-f9b3b22c2ea4",
    "title": "On antiferromagnetic regimes in the Ashkin-Teller model",
    "abstract": "The Ashkin-Teller model can be represented by a pair of Ising spin configurations with coupling constants $J$ and $J'$ for each, and $U$ for their product. We study this representation on the square lattice and confirm the presence of a mixed antiferromagnetic phase in the isotropic case ($J=J'$) when $-U>0$ is sufficiently large and $J=J'>0$ is sufficiently small, by means of a graphical representation. We then construct a coupling with the eight-vertex model and show that, in analogy to the first result, the corresponding height function is localised, although with antiferromagnetically ordered heights on one class of the graph.   Using the OSSS inequality, we proceed to establish a subcritical sharpness statement along suitable curves in the anisotropic ($J\\neq J'$) phase diagram when $U<0$, circumventing the difficulty of the lack of general monotonicity properties in the parameters. We then address the isotropic case and provide indications of monotonicity.",
    "authors": [
      "Moritz Dober"
    ],
    "url": "http://arxiv.org/abs/2406.06266v1",
    "timestamp": 1718027442,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.PR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8aff76cb-65e6-4aa0-80b4-a2137f221a34": {
    "pk": "8aff76cb-65e6-4aa0-80b4-a2137f221a34",
    "title": "DualAD: Disentangling the Dynamic and Static World for End-to-End Driving",
    "abstract": "State-of-the-art approaches for autonomous driving integrate multiple sub-tasks of the overall driving task into a single pipeline that can be trained in an end-to-end fashion by passing latent representations between the different modules. In contrast to previous approaches that rely on a unified grid to represent the belief state of the scene, we propose dedicated representations to disentangle dynamic agents and static scene elements. This allows us to explicitly compensate for the effect of both ego and object motion between consecutive time steps and to flexibly propagate the belief state through time. Furthermore, dynamic objects can not only attend to the input camera images, but also directly benefit from the inferred static scene structure via a novel dynamic-static cross-attention. Extensive experiments on the challenging nuScenes benchmark demonstrate the benefits of the proposed dual-stream design, especially for modelling highly dynamic agents in the scene, and highlight the improved temporal consistency of our approach. Our method titled DualAD not only outperforms independently trained single-task networks, but also improves over previous state-of-the-art end-to-end models by a large margin on all tasks along the functional chain of driving.",
    "authors": [
      "Simon Doll",
      "Niklas Hanselmann",
      "Lukas Schneider",
      "Richard Schulz",
      "Marius Cordts",
      "Markus Enzweiler",
      "Hendrik P. A. Lensch"
    ],
    "url": "http://arxiv.org/abs/2406.06264v1",
    "timestamp": 1718027167,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0593b337-3231-45d9-83eb-fd67c3c9c9a6": {
    "pk": "0593b337-3231-45d9-83eb-fd67c3c9c9a6",
    "title": "Modular Growth of Hierarchical Networks: Efficient, General, and Robust Curriculum Learning",
    "abstract": "Structural modularity is a pervasive feature of biological neural networks, which have been linked to several functional and computational advantages. Yet, the use of modular architectures in artificial neural networks has been relatively limited despite early successes. Here, we explore the performance and functional dynamics of a modular network trained on a memory task via an iterative growth curriculum. We find that for a given classical, non-modular recurrent neural network (RNN), an equivalent modular network will perform better across multiple metrics, including training time, generalizability, and robustness to some perturbations. We further examine how different aspects of a modular network's connectivity contribute to its computational capability. We then demonstrate that the inductive bias introduced by the modular topology is strong enough for the network to perform well even when the connectivity within modules is fixed and only the connections between modules are trained. Our findings suggest that gradual modular growth of RNNs could provide advantages for learning increasingly complex tasks on evolutionary timescales, and help build more scalable and compressible artificial networks.",
    "authors": [
      "Mani Hamidi",
      "Sina Khajehabdollahi",
      "Emmanouil Giannakakis",
      "Tim Schäfer",
      "Anna Levina",
      "Charley M. Wu"
    ],
    "url": "http://arxiv.org/abs/2406.06262v1",
    "timestamp": 1718027047,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NE",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "97143504-c1b7-41e3-97a0-53d369c011f8": {
    "pk": "97143504-c1b7-41e3-97a0-53d369c011f8",
    "title": "Compute Better Spent: Replacing Dense Layers with Structured Matrices",
    "abstract": "Dense linear layers are the dominant computational bottleneck in foundation models. Identifying more efficient alternatives to dense matrices has enormous potential for building more compute-efficient models, as exemplified by the success of convolutional networks in the image domain. In this work, we systematically explore structured matrices as replacements for dense matrices. We show that different structures often require drastically different initialization scales and learning rates, which are crucial to performance, especially as models scale. Using insights from the Maximal Update Parameterization, we determine the optimal scaling for initialization and learning rates of these unconventional layers. Finally, we measure the scaling laws of different structures to compare how quickly their performance improves with compute. We propose a novel matrix family containing Monarch matrices, the Block Tensor-Train (BTT), which we show performs better than dense matrices for the same compute on multiple tasks. On CIFAR-10/100 with augmentation, BTT achieves exponentially lower training loss than dense when training MLPs and ViTs. BTT matches dense ViT-S/32 performance on ImageNet-1k with 3.8 times less compute and is more efficient than dense for training small GPT-2 language models.",
    "authors": [
      "Shikai Qiu",
      "Andres Potapczynski",
      "Marc Finzi",
      "Micah Goldblum",
      "Andrew Gordon Wilson"
    ],
    "url": "http://arxiv.org/abs/2406.06248v1",
    "timestamp": 1718025943,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "a3aa7bb7-df87-49c6-a7a2-822a6b3b0d7e": {
    "pk": "a3aa7bb7-df87-49c6-a7a2-822a6b3b0d7e",
    "title": "Data-Efficient Learning with Neural Programs",
    "abstract": "Many computational tasks can be naturally expressed as a composition of a DNN followed by a program written in a traditional programming language or an API call to an LLM. We call such composites \"neural programs\" and focus on the problem of learning the DNN parameters when the training data consist of end-to-end input-output labels for the composite. When the program is written in a differentiable logic programming language, techniques from neurosymbolic learning are applicable, but in general, the learning for neural programs requires estimating the gradients of black-box components. We present an algorithm for learning neural programs, called ISED, that only relies on input-output samples of black-box components. For evaluation, we introduce new benchmarks that involve calls to modern LLMs such as GPT-4 and also consider benchmarks from the neurosymolic learning literature. Our evaluation shows that for the latter benchmarks, ISED has comparable performance to state-of-the-art neurosymbolic frameworks. For the former, we use adaptations of prior work on gradient approximations of black-box components as a baseline, and show that ISED achieves comparable accuracy but in a more data- and sample-efficient manner.",
    "authors": [
      "Alaia Solko-Breslin",
      "Seewon Choi",
      "Ziyang Li",
      "Neelay Velingker",
      "Rajeev Alur",
      "Mayur Naik",
      "Eric Wong"
    ],
    "url": "http://arxiv.org/abs/2406.06246v1",
    "timestamp": 1718025780,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9f316621-59e3-4044-85d1-b52c739d4f47": {
    "pk": "9f316621-59e3-4044-85d1-b52c739d4f47",
    "title": "A Lora-Based and Maintenance-Free Cattle Monitoring System for Alpine Pastures and Remote Locations",
    "abstract": "The advent of the Internet of Things (IoT) is boosting the proliferation of sensors and smart devices in industry and daily life. Continuous monitoring IoT systems are also finding applications in agriculture, particularly in the realm of smart farming. The adoption of wearable sensors to record the activity of livestock has garnered increasing interest. Such a device enables farmers to locate, monitor, and constantly assess the health status of their cattle more efficiently and effectively, even in challenging terrain and remote locations. This work presents a maintenance-free and robust smart sensing system that is capable of tracking cattle in remote locations and collecting activity parameters, such as the individual's grazing- and resting time. To support the paradigm of smart farming, the cattle tracker is capable of monitoring the cow's activity by analyzing data from an accelerometer, magnetometer, temperature sensor, and Global Navigation Satellite System (GNSS) module, providing them over Long Range Wide Area Network (LoRaWAN) to a backend server. By consuming 511.9 J per day with all subsystems enabled and a data transmission every 15 minutes, the custom-designed sensor node achieves a battery lifetime of 4 months. When exploiting the integrated solar energy harvesting subsystem, this can be even increased by 40% to up to 6 months. The final sensing system's robust operation is proven in a trial run with two cows on a pasture for over three days. Evaluations of the experimental results clearly show behavior patterns, which confirms the practicability of the proposed solution.",
    "authors": [
      "Lukas Schulthess",
      "Fabrice Longchamp",
      "Christian Vogt",
      "Michele Magno"
    ],
    "url": "http://arxiv.org/abs/2406.06245v1",
    "timestamp": 1718025665,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.SY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "350ceef3-d2d3-47bf-9005-94ae65607b64": {
    "pk": "350ceef3-d2d3-47bf-9005-94ae65607b64",
    "title": "I-MPN: Inductive Message Passing Network for Effective and Efficient Human-in-the-Loop Annotation of Mobile Eye Tracking Data",
    "abstract": "Understanding human visual processing in dynamic environments is essential for psychology and human-centered interaction design. Mobile eye-tracking systems, combining egocentric video and gaze signals, offer valuable insights. However, manual analysis of these recordings is time-intensive. In this work, we present a novel human-centered learning algorithm designed for automated object recognition within mobile eye-tracking settings. Our approach seamlessly integrates an object detector with an inductive message-passing network technique (I-MPN), harnessing node features such as node profile information and positions. This integration enables our algorithm to learn embedding functions capable of generalizing to new object angle views, thereby facilitating rapid adaptation and efficient reasoning in dynamic contexts as users navigate through their environment. Through experiments conducted on three distinct video sequences, our \\textit{interactive-based method} showcases significant performance improvements over fixed training/testing algorithms, even when trained on considerably smaller annotated samples collected through user feedback. Furthermore, we showcase exceptional efficiency in data annotation processes, surpassing approaches that use complete object detectors, combine detectors with convolutional networks, or employ interactive video segmentation.",
    "authors": [
      "Hoang H. Le",
      "Duy M. H. Nguyen",
      "Omair Shahzad Bhatti",
      "Laszlo Kopacsi",
      "Thinh P. Ngo",
      "Binh T. Nguyen",
      "Michael Barz",
      "Daniel Sonntag"
    ],
    "url": "http://arxiv.org/abs/2406.06239v1",
    "timestamp": 1718024911,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "01a0e2b7-2eaa-4937-917b-d18720085c6e": {
    "pk": "01a0e2b7-2eaa-4937-917b-d18720085c6e",
    "title": "Efficient Neural Compression with Inference-time Decoding",
    "abstract": "This paper explores the combination of neural network quantization and entropy coding for memory footprint minimization. Edge deployment of quantized models is hampered by the harsh Pareto frontier of the accuracy-to-bitwidth tradeoff, causing dramatic accuracy loss below a certain bitwidth. This accuracy loss can be alleviated thanks to mixed precision quantization, allowing for more flexible bitwidth allocation. However, standard mixed precision benefits remain limited due to the 1-bit frontier, that forces each parameter to be encoded on at least 1 bit of data. This paper introduces an approach that combines mixed precision, zero-point quantization and entropy coding to push the compression boundary of Resnets beyond the 1-bit frontier with an accuracy drop below 1% on the ImageNet benchmark. From an implementation standpoint, a compact decoder architecture features reduced latency, thus allowing for inference-compatible decoding.",
    "authors": [
      "C. Metz",
      "O. Bichler",
      "A. Dupret"
    ],
    "url": "http://arxiv.org/abs/2406.06237v1",
    "timestamp": 1718024833,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "6368b3ef-49c7-419c-ba59-b067ef7cd92a": {
    "pk": "6368b3ef-49c7-419c-ba59-b067ef7cd92a",
    "title": "UnSupDLA: Towards Unsupervised Document Layout Analysis",
    "abstract": "Document layout analysis is a key area in document research, involving techniques like text mining and visual analysis. Despite various methods developed to tackle layout analysis, a critical but frequently overlooked problem is the scarcity of labeled data needed for analyses. With the rise of internet use, an overwhelming number of documents are now available online, making the process of accurately labeling them for research purposes increasingly challenging and labor-intensive. Moreover, the diversity of documents online presents a unique set of challenges in maintaining the quality and consistency of these labels, further complicating document layout analysis in the digital era. To address this, we employ a vision-based approach for analyzing document layouts designed to train a network without labels. Instead, we focus on pre-training, initially generating simple object masks from the unlabeled document images. These masks are then used to train a detector, enhancing object detection and segmentation performance. The model's effectiveness is further amplified through several unsupervised training iterations, continuously refining its performance. This approach significantly advances document layout analysis, particularly precision and efficiency, without labels.",
    "authors": [
      "Talha Uddin Sheikh",
      "Tahira Shehzadi",
      "Khurram Azeem Hashmi",
      "Didier Stricker",
      "Muhammad Zeshan Afzal"
    ],
    "url": "http://arxiv.org/abs/2406.06236v1",
    "timestamp": 1718024788,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "42cd3e66-f470-4fc0-b8f6-56b996dbd6e4": {
    "pk": "42cd3e66-f470-4fc0-b8f6-56b996dbd6e4",
    "title": "Rényi entanglement entropy of spin chain with Generative Neural Networks",
    "abstract": "We describe a method to estimate R\\'enyi entanglement entropy of a spin system, which is based on the replica trick and generative neural networks with explicit probability estimation. It can be extended to any spin system or lattice field theory. We demonstrate our method on a one-dimensional quantum Ising spin chain. As the generative model, we use a hierarchy of autoregressive networks, allowing us to simulate up to 32 spins. We calculate the second R\\'enyi entropy and its derivative and cross-check our results with the numerical evaluation of entropy and results available in the literature.",
    "authors": [
      "Piotr Białas",
      "Piotr Korcyl",
      "Tomasz Stebel",
      "Dawid Zapolski"
    ],
    "url": "http://arxiv.org/abs/2406.06193v1",
    "timestamp": 1718019894,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cond-mat.stat-mech",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fe64db59-3277-44c0-b444-caa131b3e047": {
    "pk": "fe64db59-3277-44c0-b444-caa131b3e047",
    "title": "An Effective-Efficient Approach for Dense Multi-Label Action Detection",
    "abstract": "Unlike the sparse label action detection task, where a single action occurs in each timestamp of a video, in a dense multi-label scenario, actions can overlap. To address this challenging task, it is necessary to simultaneously learn (i) temporal dependencies and (ii) co-occurrence action relationships. Recent approaches model temporal information by extracting multi-scale features through hierarchical transformer-based networks. However, the self-attention mechanism in transformers inherently loses temporal positional information. We argue that combining this with multiple sub-sampling processes in hierarchical designs can lead to further loss of positional information. Preserving this information is essential for accurate action detection. In this paper, we address this issue by proposing a novel transformer-based network that (a) employs a non-hierarchical structure when modelling different ranges of temporal dependencies and (b) embeds relative positional encoding in its transformer layers. Furthermore, to model co-occurrence action relationships, current methods explicitly embed class relations into the transformer network. However, these approaches are not computationally efficient, as the network needs to compute all possible pair action class relations. We also overcome this challenge by introducing a novel learning paradigm that allows the network to benefit from explicitly modelling temporal co-occurrence action dependencies without imposing their additional computational costs during inference. We evaluate the performance of our proposed approach on two challenging dense multi-label benchmark datasets and show that our method improves the current state-of-the-art results.",
    "authors": [
      "Faegheh Sardari",
      "Armin Mustafa",
      "Philip J. B. Jackson",
      "Adrian Hilton"
    ],
    "url": "http://arxiv.org/abs/2406.06187v1",
    "timestamp": 1718019214,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "2e87c364-8d4f-43e1-8a1a-8bd4dca168e5": {
    "pk": "2e87c364-8d4f-43e1-8a1a-8bd4dca168e5",
    "title": "Generalized Nested Latent Variable Models for Lossy Coding applied to Wind Turbine Scenarios",
    "abstract": "Rate-distortion optimization through neural networks has accomplished competitive results in compression efficiency and image quality. This learning-based approach seeks to minimize the compromise between compression rate and reconstructed image quality by automatically extracting and retaining crucial information, while discarding less critical details. A successful technique consists in introducing a deep hyperprior that operates within a 2-level nested latent variable model, enhancing compression by capturing complex data dependencies. This paper extends this concept by designing a generalized L-level nested generative model with a Markov chain structure. We demonstrate as L increases that a trainable prior is detrimental and explore a common dimensionality along the distinct latent variables to boost compression performance. As this structured framework can represent autoregressive coders, we outperform the hyperprior model and achieve state-of-the-art performance while reducing substantially the computational cost. Our experimental evaluation is performed on wind turbine scenarios to study its application on visual inspections",
    "authors": [
      "Raül Pérez-Gonzalo",
      "Andreas Espersen",
      "Antonio Agudo"
    ],
    "url": "http://arxiv.org/abs/2406.06165v1",
    "timestamp": 1718017226,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "e2f0376e-f731-4837-aa58-0a082ee6c15a": {
    "pk": "e2f0376e-f731-4837-aa58-0a082ee6c15a",
    "title": "The Effect of Training Dataset Size on Discriminative and Diffusion-Based Speech Enhancement Systems",
    "abstract": "The performance of deep neural network-based speech enhancement systems typically increases with the training dataset size. However, studies that investigated the effect of training dataset size on speech enhancement performance did not consider recent approaches, such as diffusion-based generative models. Diffusion models are typically trained with massive datasets for image generation tasks, but whether this is also required for speech enhancement is unknown. Moreover, studies that investigated the effect of training dataset size did not control for the data diversity. It is thus unclear whether the performance improvement was due to the increased dataset size or diversity. Therefore, we systematically investigate the effect of training dataset size on the performance of popular state-of-the-art discriminative and diffusion-based speech enhancement systems. We control for the data diversity by using a fixed set of speech utterances, noise segments and binaural room impulse responses to generate datasets of different sizes. We find that the diffusion-based systems do not benefit from increasing the training dataset size as much as the discriminative systems. They perform the best relative to the discriminative systems with datasets of 10 h or less, but they are outperformed by the discriminative systems with datasets of 100 h or more.",
    "authors": [
      "Philippe Gonzalez",
      "Zheng-Hua Tan",
      "Jan Østergaard",
      "Jesper Jensen",
      "Tommy Sonne Alstrøm",
      "Tobias May"
    ],
    "url": "http://arxiv.org/abs/2406.06160v1",
    "timestamp": 1718016404,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.AS",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0191686a-3562-4faa-9920-c52b69875301": {
    "pk": "0191686a-3562-4faa-9920-c52b69875301",
    "title": "Get rich quick: exact solutions reveal how unbalanced initializations promote rapid feature learning",
    "abstract": "While the impressive performance of modern neural networks is often attributed to their capacity to efficiently extract task-relevant features from data, the mechanisms underlying this rich feature learning regime remain elusive, with much of our theoretical understanding stemming from the opposing lazy regime. In this work, we derive exact solutions to a minimal model that transitions between lazy and rich learning, precisely elucidating how unbalanced layer-specific initialization variances and learning rates determine the degree of feature learning. Our analysis reveals that they conspire to influence the learning regime through a set of conserved quantities that constrain and modify the geometry of learning trajectories in parameter and function space. We extend our analysis to more complex linear models with multiple neurons, outputs, and layers and to shallow nonlinear networks with piecewise linear activation functions. In linear networks, rapid feature learning only occurs with balanced initializations, where all layers learn at similar speeds. While in nonlinear networks, unbalanced initializations that promote faster learning in earlier layers can accelerate rich learning. Through a series of experiments, we provide evidence that this unbalanced rich regime drives feature learning in deep finite-width networks, promotes interpretability of early layers in CNNs, reduces the sample complexity of learning hierarchical data, and decreases the time to grokking in modular arithmetic. Our theory motivates further exploration of unbalanced initializations to enhance efficient feature learning.",
    "authors": [
      "Daniel Kunin",
      "Allan Raventós",
      "Clémentine Dominé",
      "Feng Chen",
      "David Klindt",
      "Andrew Saxe",
      "Surya Ganguli"
    ],
    "url": "http://arxiv.org/abs/2406.06158v1",
    "timestamp": 1718016157,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b674f067-9581-4424-95f4-f51ffd5a01cc": {
    "pk": "b674f067-9581-4424-95f4-f51ffd5a01cc",
    "title": "Towards a real-time distributed feedback system for the transportation assistance of PwD",
    "abstract": "In this work we propose the design principles of an integrated distributed system for the augment of the transportation for people with disabilities inside the road network of a city area utilizing the IT technologies. We propose the basis of our system upon the utilization of a distributed sensor network that will be incorporated by a real-time integrated feedback system. The main components of the proposed architecture include the Inaccessible City Point System, the Live Data Analysis and Response System, and the Obstruction Detection and Prevention System. The incorporation of these subsystems will provide real-time feedback assisting the transportation of individuals with mobility problems informing them on real-time about blocked ramps across the path defined to their destination, being also responsible for the information of the authorities about incidents regarding the collision of accessibility in place where the sensors detect an inaccessible point. The proposed design allows the addition of further extensions regarding the assistance of individuals with mobility problems providing a basis for its further implementation and improvement. In this work we provide the fundamental parts regarding the interconnection of the proposed architecture's components as also its potential deployment regarding the proposed architecture and its application in the area of a city.",
    "authors": [
      "Iosif Polenakis",
      "Vasileios Vouronikos",
      "Maria Chroni",
      "Stavros D. Nikolopoulos"
    ],
    "url": "http://arxiv.org/abs/2406.06154v1",
    "timestamp": 1718015499,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CY",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "fac0ca35-150d-4fbc-a91e-cee17fa98eda": {
    "pk": "fac0ca35-150d-4fbc-a91e-cee17fa98eda",
    "title": "On the Complexity of Inverse Bivariate Multi-unit Assignment Valuation Problems",
    "abstract": "Inverse and bilevel optimization problems play a central role in both theory and applications. These two classes are known to be closely related due to the pioneering work of Dempe and Lohse (2006), and thus have often been discussed together ever since. In this paper, we consider inverse problems for multi-unit assignment valuations. Multi-unit assignment valuations form a subclass of strong-substitutes valuations that can be represented by edge-weighted complete bipartite graphs. These valuations play a key role in auction theory as the strong substitutes condition implies the existence of a Walrasian equilibrium. A recent line of research concentrated on the problem of deciding whether a bivariate valuation function is an assignment valuation or not. In this paper, we consider an \\emph{inverse} variant of the problem: we are given a bivariate function $g$, and our goal is to find a bivariate multi-unit assignment valuation function $f$ that is as close to $g$ as possible. The difference between $f$ and $g$ can be measured either in $\\ell_1$- or $\\ell_\\infty$-norm. Using tools from discrete convex analysis, we show that the problem is strongly NP-hard. On the other hand, we derive linear programming formulations that solve relaxed versions of the problem.",
    "authors": [
      "Kristóf Bérczi",
      "Lydia Mirabel Mendoza-Cadena"
    ],
    "url": "http://arxiv.org/abs/2406.06152v1",
    "timestamp": 1718015136,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.OC",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "060e1b17-440a-45a9-905e-d2de63909c75": {
    "pk": "060e1b17-440a-45a9-905e-d2de63909c75",
    "title": "Physics-Informed Bayesian Optimization of Variational Quantum Circuits",
    "abstract": "In this paper, we propose a novel and powerful method to harness Bayesian optimization for Variational Quantum Eigensolvers (VQEs) -- a hybrid quantum-classical protocol used to approximate the ground state of a quantum Hamiltonian. Specifically, we derive a VQE-kernel which incorporates important prior information about quantum circuits: the kernel feature map of the VQE-kernel exactly matches the known functional form of the VQE's objective function and thereby significantly reduces the posterior uncertainty. Moreover, we propose a novel acquisition function for Bayesian optimization called Expected Maximum Improvement over Confident Regions (EMICoRe) which can actively exploit the inductive bias of the VQE-kernel by treating regions with low predictive uncertainty as indirectly ``observed''. As a result, observations at as few as three points in the search domain are sufficient to determine the complete objective function along an entire one-dimensional subspace of the optimization landscape. Our numerical experiments demonstrate that our approach improves over state-of-the-art baselines.",
    "authors": [
      "Kim A. Nicoli",
      "Christopher J. Anders",
      "Lena Funcke",
      "Tobias Hartung",
      "Karl Jansen",
      "Stefan Kühn",
      "Klaus-Robert Müller",
      "Paolo Stornati",
      "Pan Kessel",
      "Shinichi Nakajima"
    ],
    "url": "http://arxiv.org/abs/2406.06150v1",
    "timestamp": 1718014626,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "6795da2b-5a3a-47ff-8d3a-3ca898b93ab2": {
    "pk": "6795da2b-5a3a-47ff-8d3a-3ca898b93ab2",
    "title": "Decoupled Marked Temporal Point Process using Neural Ordinary Differential Equations",
    "abstract": "A Marked Temporal Point Process (MTPP) is a stochastic process whose realization is a set of event-time data. MTPP is often used to understand complex dynamics of asynchronous temporal events such as money transaction, social media, healthcare, etc. Recent studies have utilized deep neural networks to capture complex temporal dependencies of events and generate embedding that aptly represent the observed events. While most previous studies focus on the inter-event dependencies and their representations, how individual events influence the overall dynamics over time has been under-explored. In this regime, we propose a Decoupled MTPP framework that disentangles characterization of a stochastic process into a set of evolving influences from different events. Our approach employs Neural Ordinary Differential Equations (Neural ODEs) to learn flexible continuous dynamics of these influences while simultaneously addressing multiple inference problems, such as density estimation and survival rate computation. We emphasize the significance of disentangling the influences by comparing our framework with state-of-the-art methods on real-life datasets, and provide analysis on the model behavior for potential applications.",
    "authors": [
      "Yujee Song",
      "Donghyun Lee",
      "Rui Meng",
      "Won Hwa Kim"
    ],
    "url": "http://arxiv.org/abs/2406.06149v1",
    "timestamp": 1718014532,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b7e3d474-d659-4ffa-82e8-d66b0ad844f4": {
    "pk": "b7e3d474-d659-4ffa-82e8-d66b0ad844f4",
    "title": "A Comparative Survey of Vision Transformers for Feature Extraction in Texture Analysis",
    "abstract": "Texture, a significant visual attribute in images, has been extensively investigated across various image recognition applications. Convolutional Neural Networks (CNNs), which have been successful in many computer vision tasks, are currently among the best texture analysis approaches. On the other hand, Vision Transformers (ViTs) have been surpassing the performance of CNNs on tasks such as object recognition, causing a paradigm shift in the field. However, ViTs have so far not been scrutinized for texture recognition, hindering a proper appreciation of their potential in this specific setting. For this reason, this work explores various pre-trained ViT architectures when transferred to tasks that rely on textures. We review 21 different ViT variants and perform an extensive evaluation and comparison with CNNs and hand-engineered models on several tasks, such as assessing robustness to changes in texture rotation, scale, and illumination, and distinguishing color textures, material textures, and texture attributes. The goal is to understand the potential and differences among these models when directly applied to texture recognition, using pre-trained ViTs primarily for feature extraction and employing linear classifiers for evaluation. We also evaluate their efficiency, which is one of the main drawbacks in contrast to other methods. Our results show that ViTs generally outperform both CNNs and hand-engineered models, especially when using stronger pre-training and tasks involving in-the-wild textures (images from the internet). We highlight the following promising models: ViT-B with DINO pre-training, BeiTv2, and the Swin architecture, as well as the EfficientFormer as a low-cost alternative. In terms of efficiency, although having a higher number of GFLOPs and parameters, ViT-B and BeiT(v2) can achieve a lower feature extraction time on GPUs compared to ResNet50.",
    "authors": [
      "Leonardo Scabini",
      "Andre Sacilotti",
      "Kallil M. Zielinski",
      "Lucas C. Ribas",
      "Bernard De Baets",
      "Odemir M. Bruno"
    ],
    "url": "http://arxiv.org/abs/2406.06136v1",
    "timestamp": 1718012893,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "4da32f4d-1994-4179-8477-31affeb831be": {
    "pk": "4da32f4d-1994-4179-8477-31affeb831be",
    "title": "ExtraNeRF: Visibility-Aware View Extrapolation of Neural Radiance Fields with Diffusion Models",
    "abstract": "We propose ExtraNeRF, a novel method for extrapolating the range of views handled by a Neural Radiance Field (NeRF). Our main idea is to leverage NeRFs to model scene-specific, fine-grained details, while capitalizing on diffusion models to extrapolate beyond our observed data. A key ingredient is to track visibility to determine what portions of the scene have not been observed, and focus on reconstructing those regions consistently with diffusion models. Our primary contributions include a visibility-aware diffusion-based inpainting module that is fine-tuned on the input imagery, yielding an initial NeRF with moderate quality (often blurry) inpainted regions, followed by a second diffusion model trained on the input imagery to consistently enhance, notably sharpen, the inpainted imagery from the first pass. We demonstrate high-quality results, extrapolating beyond a small number of (typically six or fewer) input views, effectively outpainting the NeRF as well as inpainting newly disoccluded regions inside the original viewing volume. We compare with related work both quantitatively and qualitatively and show significant gains over prior art.",
    "authors": [
      "Meng-Li Shih",
      "Wei-Chiu Ma",
      "Aleksander Holynski",
      "Forrester Cole",
      "Brian L. Curless",
      "Janne Kontkanen"
    ],
    "url": "http://arxiv.org/abs/2406.06133v1",
    "timestamp": 1718012646,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "36b20422-7834-454f-8eab-feb202c25af4": {
    "pk": "36b20422-7834-454f-8eab-feb202c25af4",
    "title": "Building Bridges: A Dataset for Evaluating Gender-Fair Machine Translation into German",
    "abstract": "The translation of gender-neutral person-referring terms (e.g., the students) is often non-trivial. Translating from English into German poses an interesting case -- in German, person-referring nouns are usually gender-specific, and if the gender of the referent(s) is unknown or diverse, the generic masculine (die Studenten (m.)) is commonly used. This solution, however, reduces the visibility of other genders, such as women and non-binary people. To counteract gender discrimination, a societal movement towards using gender-fair language exists (e.g., by adopting neosystems). However, gender-fair German is currently barely supported in machine translation (MT), requiring post-editing or manual translations. We address this research gap by studying gender-fair language in English-to-German MT. Concretely, we enrich a community-created gender-fair language dictionary and sample multi-sentence test instances from encyclopedic text and parliamentary speeches. Using these novel resources, we conduct the first benchmark study involving two commercial systems and six neural MT models for translating words in isolation and natural contexts across two domains. Our findings show that most systems produce mainly masculine forms and rarely gender-neutral variants, highlighting the need for future research. We release code and data at https://github.com/g8a9/building-bridges-gender-fair-german-mt.",
    "authors": [
      "Manuel Lardelli",
      "Giuseppe Attanasio",
      "Anne Lauscher"
    ],
    "url": "http://arxiv.org/abs/2406.06131v1",
    "timestamp": 1718012359,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "b16a6c2f-e0f9-4bbe-a750-10ade6d83e85": {
    "pk": "b16a6c2f-e0f9-4bbe-a750-10ade6d83e85",
    "title": "Federated Machine Reasoning for Resource Provisioning in 6G O-RAN",
    "abstract": "O-RAN specifications reshape RANs with function disaggregation and open interfaces, driven by RAN Intelligent Controllers. This enables data-driven management through AI/ML but poses trust challenges due to human operators' limited understanding of AI/ML decision-making. Balancing resource provisioning and avoiding overprovisioning and underprovisioning is critical, especially among the multiple virtualized base station(vBS) instances. Thus, we propose a novel Federated Machine Reasoning (FLMR) framework, a neurosymbolic method for federated reasoning, learning, and querying. FLMR optimizes CPU demand prediction based on contextual information and vBS configuration using local monitoring data from virtual base stations (vBS) on a shared O-Cloud platform.This optimization is critical, as insufficient computing resources can result in synchronization loss and significantly reduce network throughput. In the telecom domain, particularly in the virtual Radio Access Network (vRAN) sector, predicting and managing the CPU load of vBSs poses a significant challenge for network operators. Our proposed FLMR framework ensures transparency and human understanding in AI/ML decisions and addresses the evolving demands of the 6G O-RAN landscape, where reliability and performance are paramount. Furthermore, we performed a comparative analysis using \\textit{DeepCog} as the baseline method. The outcomes highlight how our proposed approach outperforms the baseline and strikes a better balance between resource overprovisioning and underprovisioning. Our method notably lowers both provisioning relative to the baseline by a factor of 6.",
    "authors": [
      "Swastika Roy",
      "Hatim Chergui",
      "Adlen Ksentini",
      "Christos Verikoukis"
    ],
    "url": "http://arxiv.org/abs/2406.06128v1",
    "timestamp": 1718012271,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.IT",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "51763efe-e11e-41ba-8650-2e34eddfc2ae": {
    "pk": "51763efe-e11e-41ba-8650-2e34eddfc2ae",
    "title": "W-Net: One-Shot Arbitrary-Style Chinese Character Generation with Deep Neural Networks",
    "abstract": "Due to the huge category number, the sophisticated combinations of various strokes and radicals, and the free writing or printing styles, generating Chinese characters with diverse styles is always considered as a difficult task. In this paper, an efficient and generalized deep framework, namely, the W-Net, is introduced for the one-shot arbitrary-style Chinese character generation task. Specifically, given a single character (one-shot) with a specific style (e.g., a printed font or hand-writing style), the proposed W-Net model is capable of learning and generating any arbitrary characters sharing the style similar to the given single character. Such appealing property was rarely seen in the literature. We have compared the proposed W-Net framework to many other competitive methods. Experimental results showed the proposed method is significantly superior in the one-shot setting.",
    "authors": [
      "Haochuan Jiang",
      "Guanyu Yang",
      "Kaizhu Huang",
      "Rui Zhang"
    ],
    "url": "http://arxiv.org/abs/2406.06122v1",
    "timestamp": 1718010987,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "decc995e-717b-479b-8118-3f2f59152e90": {
    "pk": "decc995e-717b-479b-8118-3f2f59152e90",
    "title": "JenGAN: Stacked Shifted Filters in GAN-Based Speech Synthesis",
    "abstract": "Non-autoregressive GAN-based neural vocoders are widely used due to their fast inference speed and high perceptual quality. However, they often suffer from audible artifacts such as tonal artifacts in their generated results. Therefore, we propose JenGAN, a new training strategy that involves stacking shifted low-pass filters to ensure the shift-equivariant property. This method helps prevent aliasing and reduce artifacts while preserving the model structure used during inference. In our experimental evaluation, JenGAN consistently enhances the performance of vocoder models, yielding significantly superior scores across the majority of evaluation metrics.",
    "authors": [
      "Hyunjae Cho",
      "Junhyeok Lee",
      "Wonbin Jung"
    ],
    "url": "http://arxiv.org/abs/2406.06111v1",
    "timestamp": 1718009464,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "eess.AS",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "0f2463cc-5d25-4824-b1d3-400e8a296ea0": {
    "pk": "0f2463cc-5d25-4824-b1d3-400e8a296ea0",
    "title": "EXPIL: Explanatory Predicate Invention for Learning in Games",
    "abstract": "Reinforcement learning (RL) has proven to be a powerful tool for training agents that excel in various games. However, the black-box nature of neural network models often hinders our ability to understand the reasoning behind the agent's actions. Recent research has attempted to address this issue by using the guidance of pretrained neural agents to encode logic-based policies, allowing for interpretable decisions. A drawback of such approaches is the requirement of large amounts of predefined background knowledge in the form of predicates, limiting its applicability and scalability. In this work, we propose a novel approach, Explanatory Predicate Invention for Learning in Games (EXPIL), that identifies and extracts predicates from a pretrained neural agent, later used in the logic-based agents, reducing the dependency on predefined background knowledge. Our experimental evaluation on various games demonstrate the effectiveness of EXPIL in achieving explainable behavior in logic agents while requiring less background knowledge.",
    "authors": [
      "Jingyuan Sha",
      "Hikaru Shindo",
      "Quentin Delfosse",
      "Kristian Kersting",
      "Devendra Singh Dhami"
    ],
    "url": "http://arxiv.org/abs/2406.06107v1",
    "timestamp": 1718009209,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.AI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "02106134-c861-4eba-8c8a-1badc28d4723": {
    "pk": "02106134-c861-4eba-8c8a-1badc28d4723",
    "title": "The Evolution of Applications, Hardware Design, and Channel Modeling for Terahertz (THz) Band Communications and Sensing: Ready for 6G?",
    "abstract": "For decades, the terahertz (THz) frequency band had been primarily explored in the context of radar, imaging, and spectroscopy, where multi-gigahertz (GHz) and even THz-wide channels and the properties of terahertz photons offered attractive target accuracy, resolution, and classification capabilities. Meanwhile, the exploitation of the terahertz band for wireless communication had originally been limited due to several reasons, including (i) no immediate need for such high data rates available via terahertz bands and (ii) challenges in designing sufficiently high power terahertz systems at reasonable cost and efficiency, leading to what was often referred to as \"the terahertz gap\". This roadmap paper first reviews the evolution of the hardware design approaches for terahertz systems, including electronic, photonic, and plasmonic approaches, and the understanding of the terahertz channel itself, in diverse scenarios, ranging from common indoors and outdoors scenarios to intra-body and outer-space environments. The article then summarizes the lessons learned during this multi-decade process and the cutting-edge state-of-the-art findings, including novel methods to quantify power efficiency, which will become more important in making design choices. Finally, the manuscript presents the authors' perspective and insights on how the evolution of terahertz systems design will continue toward enabling efficient terahertz communications and sensing solutions as an integral part of next-generation wireless systems.",
    "authors": [
      "Josep M. Jornet",
      "Vitaly Petrov",
      "Hua Wang",
      "Zoya Popovic",
      "Dipankar Shakya",
      "Jose V. Siles",
      "Theodore S. Rappaport"
    ],
    "url": "http://arxiv.org/abs/2406.06105v1",
    "timestamp": 1718008811,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "a9d95c88-b995-40e2-adab-cd48490db91a": {
    "pk": "a9d95c88-b995-40e2-adab-cd48490db91a",
    "title": "Sequential Binary Classification for Intrusion Detection in Software Defined Networks",
    "abstract": "Software-Defined Networks (SDN) are the standard architecture for network deployment. Intrusion Detection Systems (IDS) are a pivotal part of this technology as networks become more vulnerable to new and sophisticated attacks. Machine Learning (ML)-based IDS are increasingly seen as the most effective approach to handle this issue. However, IDS datasets suffer from high class imbalance, which impacts the performance of standard ML models. We propose Sequential Binary Classification (SBC) - an algorithm for multi-class classification to address this issue. SBC is a hierarchical cascade of base classifiers, each of which can be modelled on any general binary classifier. Extensive experiments are reported on benchmark datasets that evaluate the performance of SBC under different scenarios.",
    "authors": [
      "Ishan Chokshi",
      "Shrihari Vasudevan",
      "Nachiappan Sundaram",
      "Raaghul Ranganathan"
    ],
    "url": "http://arxiv.org/abs/2406.06099v1",
    "timestamp": 1718008453,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "24f9d332-11cb-4f81-ab04-307c7f699838": {
    "pk": "24f9d332-11cb-4f81-ab04-307c7f699838",
    "title": "Texture Re-scalable Universal Adversarial Perturbation",
    "abstract": "Universal adversarial perturbation (UAP), also known as image-agnostic perturbation, is a fixed perturbation map that can fool the classifier with high probabilities on arbitrary images, making it more practical for attacking deep models in the real world. Previous UAP methods generate a scale-fixed and texture-fixed perturbation map for all images, which ignores the multi-scale objects in images and usually results in a low fooling ratio. Since the widely used convolution neural networks tend to classify objects according to semantic information stored in local textures, it seems a reasonable and intuitive way to improve the UAP from the perspective of utilizing local contents effectively. In this work, we find that the fooling ratios significantly increase when we add a constraint to encourage a small-scale UAP map and repeat it vertically and horizontally to fill the whole image domain. To this end, we propose texture scale-constrained UAP (TSC-UAP), a simple yet effective UAP enhancement method that automatically generates UAPs with category-specific local textures that can fool deep models more easily. Through a low-cost operation that restricts the texture scale, TSC-UAP achieves a considerable improvement in the fooling ratio and attack transferability for both data-dependent and data-free UAP methods. Experiments conducted on two state-of-the-art UAP methods, eight popular CNN models and four classical datasets show the remarkable performance of TSC-UAP.",
    "authors": [
      "Yihao Huang",
      "Qing Guo",
      "Felix Juefei-Xu",
      "Ming Hu",
      "Xiaojun Jia",
      "Xiaochun Cao",
      "Geguang Pu",
      "Yang Liu"
    ],
    "url": "http://arxiv.org/abs/2406.06089v1",
    "timestamp": 1718007535,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1f638e30-55d1-4bbd-964e-e220f47932ce": {
    "pk": "1f638e30-55d1-4bbd-964e-e220f47932ce",
    "title": "A characterization of uniquely representable two-directional orthogonal ray graphs",
    "abstract": "In this paper, we provide a characterization of uniquely representable two-directional orthogonal ray graphs, which are defined as the intersection graphs of rightward and downward rays. The collection of these rays is called a representation of the graph. Two-directional orthogonal ray graphs are equivalent to several well-studied classes of graphs, including complements of circular-arc graphs with clique cover number two. Normalized representations of two-directional orthogonal ray graphs, where the positions of certain rays are determined by neighborhood containment relations, can be obtained from the normalized representations of circular-arc graphs. However, the normalized representations are not necessarily unique, even when considering only the relative positions of the rays. Recent studies indicate that two-directional orthogonal ray graphs share similar characterizations to interval graphs. Hanlon (1982) and Fishburn (1985) characterized uniquely representable interval graphs by introducing the notion of a buried subgraph. Following their characterization, we define buried subgraphs of two-directional orthogonal ray graphs and prove that their absence is a necessary and sufficient condition for a graph to be uniquely representable.",
    "authors": [
      "Asahi Takaoka"
    ],
    "url": "http://arxiv.org/abs/2406.06077v1",
    "timestamp": 1718005845,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "33eeca0c-cd94-4edd-b5fc-eb214be9b853": {
    "pk": "33eeca0c-cd94-4edd-b5fc-eb214be9b853",
    "title": "Text Analysis of ETDs in ProQuest Dissertations and Theses (PQDT) Global (2016-2018)",
    "abstract": "The information explosion in the form of ETDs poses the challenge of management and extraction of appropriate knowledge for decision-making. Thus, the present study forwards a solution to the above problem by applying topic mining and prediction modeling tools to 263 ETDs submitted to the PQDT Global database during 2016-18 in the field of library science. This study was divided into two phases. The first phase determined the core topics from the ETDs using Topic-Modeling-Tool (TMT), which was based on latent dirichlet allocation (LDA), whereas the second phase employed prediction analysis using RapidMinerplatform to annotate the future research articles on the basis of the modeled topics. The core topics (tags) for the studied period were found to be book history, school librarian, public library, communicative ecology, and informatics followed by text network and trend analysis on the high probability cooccurred words. Lastly, a prediction model using Support Vector Machine (SVM) classifier was created in order to accurately predict the placement of future ETDs going to be submitted to PQDT Global under the five modeled topics (a to e). The tested dataset against the trained data set for the predictive performed perfectly.",
    "authors": [
      "Manika Lamba"
    ],
    "url": "http://arxiv.org/abs/2406.06076v1",
    "timestamp": 1718005841,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.DL",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "1a924b5f-1605-4832-8a2e-c66739d4e657": {
    "pk": "1a924b5f-1605-4832-8a2e-c66739d4e657",
    "title": "Supervised Radio Frequency Interference Detection with SNNs",
    "abstract": "Radio Frequency Interference (RFI) poses a significant challenge in radio astronomy, arising from terrestrial and celestial sources, disrupting observations conducted by radio telescopes. Addressing RFI involves intricate heuristic algorithms, manual examination, and, increasingly, machine learning methods. Given the dynamic and temporal nature of radio astronomy observations, Spiking Neural Networks (SNNs) emerge as a promising approach. In this study, we cast RFI detection as a supervised multi-variate time-series segmentation problem. Notably, our investigation explores the encoding of radio astronomy visibility data for SNN inference, considering six encoding schemes: rate, latency, delta-modulation, and three variations of the step-forward algorithm. We train a small two-layer fully connected SNN on simulated data derived from the Hydrogen Epoch of Reionization Array (HERA) telescope and perform extensive hyper-parameter optimization. Results reveal that latency encoding exhibits superior performance, achieving a per-pixel accuracy of 98.8% and an f1-score of 0.761. Remarkably, these metrics approach those of contemporary RFI detection algorithms, notwithstanding the simplicity and compactness of our proposed network architecture. This study underscores the potential of RFI detection as a benchmark problem for SNN researchers, emphasizing the efficacy of SNNs in addressing complex time-series segmentation tasks in radio astronomy.",
    "authors": [
      "Nicholas J. Pritchard",
      "Andreas Wicenec",
      "Mohammed Bennamoun",
      "Richard Dodson"
    ],
    "url": "http://arxiv.org/abs/2406.06075v1",
    "timestamp": 1718005791,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NE",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "ef1c3c3f-1cd9-4d65-bfdb-c8bf4858df5c": {
    "pk": "ef1c3c3f-1cd9-4d65-bfdb-c8bf4858df5c",
    "title": "Instability of Self-Driving Satellite Mega-Constellation: From Theory to Practical Impacts on Network Lifetime and Capacity",
    "abstract": "Low Earth Orbit (LEO) satellite mega-constellations aim to enable high-speed Internet for numerous users anywhere on Earth. To safeguard their network infrastructure in congested outer space, they perform automatic orbital maneuvers to avoid collisions with external debris and satellites. However, our control-theoretic analysis and empirical validation using Starlink's space situational awareness datasets discover that, these safety-oriented maneuvers themselves can threaten safety and networking via cascaded collision avoidance inside the mega-constellation. This domino effect forces a dilemma between long-term LEO network lifetime and short-term LEO network capacity. Its root cause is that, the decades-old local pairwise maneuver paradigm for standalone satellites is inherently unstable if scaled out to recent mega-constellation networks. We thus propose an alternative bilateral maneuver control that stabilizes self-driving mega-constellations for concurrent network lifetime and capacity boosts. Our operational trace-driven emulation shows a 8$\\times$ network lifetime extension in Starlink without limiting its network capacity.",
    "authors": [
      "Yimei Chen",
      "Yuanjie Li",
      "Hewu Li",
      "Lixin Liu",
      "Li Ouyang",
      "Jiabo Yang",
      "Junyi Li",
      "Jianping Wu",
      "Qian Wu",
      "Jun Liu",
      "Zeqi Lai"
    ],
    "url": "http://arxiv.org/abs/2406.06068v1",
    "timestamp": 1718004200,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9a95e73c-5f5f-4093-bb26-8b6226c91358": {
    "pk": "9a95e73c-5f5f-4093-bb26-8b6226c91358",
    "title": "6DMA Enhanced Wireless Network with Flexible Antenna Position and Rotation: Opportunities and Challenges",
    "abstract": "6DMA (six-dimensional movable antenna) is a new and revolutionizing technology that fully exploits the wireless channel spatial variation at the transmitter/receiver by flexibly adjusting the three-dimensional (3D) positions and 3D rotations of distributed antennas/antenna surfaces (arrays). In this article, we provide an overview of 6DMA for unveiling its great potential in wireless networks, including its motivation and competitive advantages over existing technologies, system/channel modeling, and practical implementation. In particular, we present a variety of 6DMA-enabled performance enhancement in terms of array gain, spatial multiplexing, interference suppression, and geometric gain. Furthermore, we illustrate the main applications of 6DMA in wireless communication and sensing, and elaborate their design challenges as well as promising solutions. Finally, numerical results are provided to demonstrate the significant capacity improvement of 6DMA-aided communication in wireless network.",
    "authors": [
      "Xiaodan Shao",
      "Rui Zhang"
    ],
    "url": "http://arxiv.org/abs/2406.06064v1",
    "timestamp": 1718004103,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.IT",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "627606dd-65bd-4b77-95da-9c9c81c37327": {
    "pk": "627606dd-65bd-4b77-95da-9c9c81c37327",
    "title": "ProcessPainter: Learn Painting Process from Sequence Data",
    "abstract": "The painting process of artists is inherently stepwise and varies significantly among different painters and styles. Generating detailed, step-by-step painting processes is essential for art education and research, yet remains largely underexplored. Traditional stroke-based rendering methods break down images into sequences of brushstrokes, yet they fall short of replicating the authentic processes of artists, with limitations confined to basic brushstroke modifications. Text-to-image models utilizing diffusion processes generate images through iterative denoising, also diverge substantially from artists' painting process. To address these challenges, we introduce ProcessPainter, a text-to-video model that is initially pre-trained on synthetic data and subsequently fine-tuned with a select set of artists' painting sequences using the LoRA model. This approach successfully generates painting processes from text prompts for the first time. Furthermore, we introduce an Artwork Replication Network capable of accepting arbitrary-frame input, which facilitates the controlled generation of painting processes, decomposing images into painting sequences, and completing semi-finished artworks. This paper offers new perspectives and tools for advancing art education and image generation technology.",
    "authors": [
      "Yiren Song",
      "Shijie Huang",
      "Chen Yao",
      "Xiaojun Ye",
      "Hai Ci",
      "Jiaming Liu",
      "Yuxuan Zhang",
      "Mike Zheng Shou"
    ],
    "url": "http://arxiv.org/abs/2406.06062v1",
    "timestamp": 1718003921,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "c94daa03-d792-47e3-b78e-71ebcc441670": {
    "pk": "c94daa03-d792-47e3-b78e-71ebcc441670",
    "title": "Learning Physical Simulation with Message Passing Transformer",
    "abstract": "Machine learning methods for physical simulation have achieved significant success in recent years. We propose a new universal architecture based on Graph Neural Network, the Message Passing Transformer, which incorporates a Message Passing framework, employs an Encoder-Processor-Decoder structure, and applies Graph Fourier Loss as loss function for model optimization. To take advantage of the past message passing state information, we propose Hadamard-Product Attention to update the node attribute in the Processor, Hadamard-Product Attention is a variant of Dot-Product Attention that focuses on more fine-grained semantics and emphasizes on assigning attention weights over each feature dimension rather than each position in the sequence relative to others. We further introduce Graph Fourier Loss (GFL) to balance high-energy and low-energy components. To improve time performance, we precompute the graph's Laplacian eigenvectors before the training process. Our architecture achieves significant accuracy improvements in long-term rollouts for both Lagrangian and Eulerian dynamical systems over current methods.",
    "authors": [
      "Zeyi Xu",
      "Yifei Li"
    ],
    "url": "http://arxiv.org/abs/2406.06060v1",
    "timestamp": 1718003696,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.LG",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "8d912721-d42a-44ca-9a7d-b73f72649eb5": {
    "pk": "8d912721-d42a-44ca-9a7d-b73f72649eb5",
    "title": "LLM-Based Intent Processing and Network Optimization Using Attention-Based Hierarchical Reinforcement Learning",
    "abstract": "Intent-based network automation is a promising tool to enable easier network management however certain challenges need to be effectively addressed. These are: 1) processing intents, i.e., identification of logic and necessary parameters to fulfill an intent, 2) validating an intent to align it with current network status, and 3) satisfying intents via network optimizing functions like xApps and rApps in O-RAN. This paper addresses these points via a three-fold strategy to introduce intent-based automation for O-RAN. First, intents are processed via a lightweight Large Language Model (LLM). Secondly, once an intent is processed, it is validated against future incoming traffic volume profiles (high or low). Finally, a series of network optimization applications (rApps and xApps) have been developed. With their machine learning-based functionalities, they can improve certain key performance indicators such as throughput, delay, and energy efficiency. In this final stage, using an attention-based hierarchical reinforcement learning algorithm, these applications are optimally initiated to satisfy the intent of an operator. Our simulations show that the proposed method can achieve at least 12% increase in throughput, 17.1% increase in energy efficiency, and 26.5% decrease in network delay compared to the baseline algorithms.",
    "authors": [
      "Md Arafat Habib",
      "Pedro Enrique Iturria Rivera",
      "Yigit Ozcan",
      "Medhat Elsayed",
      "Majid Bavand",
      "Raimundus Gaigalas",
      "Melike Erol-Kantarci"
    ],
    "url": "http://arxiv.org/abs/2406.06059v1",
    "timestamp": 1718003634,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.NI",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "f43042a4-98e9-4700-be83-518ceb0a7f52": {
    "pk": "f43042a4-98e9-4700-be83-518ceb0a7f52",
    "title": "Modeling User Retention through Generative Flow Networks",
    "abstract": "Recommender systems aim to fulfill the user's daily demands. While most existing research focuses on maximizing the user's engagement with the system, it has recently been pointed out that how frequently the users come back for the service also reflects the quality and stability of recommendations. However, optimizing this user retention behavior is non-trivial and poses several challenges including the intractable leave-and-return user activities, the sparse and delayed signal, and the uncertain relations between users' retention and their immediate feedback towards each item in the recommendation list. In this work, we regard the retention signal as an overall estimation of the user's end-of-session satisfaction and propose to estimate this signal through a probabilistic flow. This flow-based modeling technique can back-propagate the retention reward towards each recommended item in the user session, and we show that the flow combined with traditional learning-to-rank objectives eventually optimizes a non-discounted cumulative reward for both immediate user feedback and user retention. We verify the effectiveness of our method through both offline empirical studies on two public datasets and online A/B tests in an industrial platform.",
    "authors": [
      "Ziru Liu",
      "Shuchang Liu",
      "Bin Yang",
      "Zhenghai Xue",
      "Qingpeng Cai",
      "Xiangyu Zhao",
      "Zijian Zhang",
      "Lantao Hu",
      "Han Li",
      "Peng Jiang"
    ],
    "url": "http://arxiv.org/abs/2406.06043v1",
    "timestamp": 1718000538,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.IR",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "597870b4-96ba-49a1-9810-898e392d9aeb": {
    "pk": "597870b4-96ba-49a1-9810-898e392d9aeb",
    "title": "Diving into Underwater: Segment Anything Model Guided Underwater Salient Instance Segmentation and A Large-scale Dataset",
    "abstract": "With the breakthrough of large models, Segment Anything Model (SAM) and its extensions have been attempted to apply in diverse tasks of computer vision. Underwater salient instance segmentation is a foundational and vital step for various underwater vision tasks, which often suffer from low segmentation accuracy due to the complex underwater circumstances and the adaptive ability of models. Moreover, the lack of large-scale datasets with pixel-level salient instance annotations has impeded the development of machine learning techniques in this field. To address these issues, we construct the first large-scale underwater salient instance segmentation dataset (USIS10K), which contains 10,632 underwater images with pixel-level annotations in 7 categories from various underwater scenes. Then, we propose an Underwater Salient Instance Segmentation architecture based on Segment Anything Model (USIS-SAM) specifically for the underwater domain. We devise an Underwater Adaptive Visual Transformer (UA-ViT) encoder to incorporate underwater domain visual prompts into the segmentation network. We further design an out-of-the-box underwater Salient Feature Prompter Generator (SFPG) to automatically generate salient prompters instead of explicitly providing foreground points or boxes as prompts in SAM. Comprehensive experimental results show that our USIS-SAM method can achieve superior performance on USIS10K datasets compared to the state-of-the-art methods. Datasets and codes are released on https://github.com/LiamLian0727/USIS10K.",
    "authors": [
      "Shijie Lian",
      "Ziyi Zhang",
      "Hua Li",
      "Wenjie Li",
      "Laurence Tianruo Yang",
      "Sam Kwong",
      "Runmin Cong"
    ],
    "url": "http://arxiv.org/abs/2406.06039v1",
    "timestamp": 1718000253,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "cs.CV",
    "references": null,
    "citation_count": 0,
    "award": null
  },
  "9646fef7-0192-46b3-b151-8f5977d1965d": {
    "pk": "9646fef7-0192-46b3-b151-8f5977d1965d",
    "title": "Truncated-degree-choosability of planar graphs",
    "abstract": "Assume $G$ is a graph and $k$ is a positive integer. Let $f:V(G)\\to N$ be defined as $f(v)=\\min\\{k,d_G(v)\\}$. If $G$ is $f$-choosable, then we say $G$ is $k$-truncated-degree-choosable. It was proved in [Zhou,Zhu,Zhu, Arc-weighted acyclic orientations and variations of degeneracy of graphs, arXiv:2308.15853] that there is a 3-connected non-complete planar graph that is not 7-truncated-degree-choosable, and every 3-connected non-complete planar graph is 16-truncated-degree-choosable. This paper improves the bounds, and proves that there is a 3-connected non-complete planar graph that is not 8-truncated-degree-choosable and every non-complete 3-connected planar graph is 12-truncated-degree-choosable.",
    "authors": [
      "Yiting Jiang",
      "Huijuan Xu",
      "Xinbo Xu",
      "Xuding Zhu"
    ],
    "url": "http://arxiv.org/abs/2406.06035v1",
    "timestamp": 1717999068,
    "section_contents": null,
    "table_captions": null,
    "figure_captions": null,
    "bibliography": null,
    "keywords": null,
    "domain": "math.CO",
    "references": null,
    "citation_count": 0,
    "award": null
  }
}